class Roquia {
    hr = "*----*----*----*----*";
    sora = ["الفهرس", "الفاتحة", "البقرة", "آل عمران", "النساء", "المائدة", "الأنعام", "الأعراف", "الأنفال", "التوبة", "يونس", "هود", "يوسف", "الرعد", "ابراهيم", "الحجر", "النحل", "الإسراء", "الكهف", "مريم", "طه", "الأنبياء", "الحج", "المؤمنون", "النور", "الفرقان", "الشعراء", "النمل", "القصص", "العنكبوت", "الروم", "لقمان", "السجدة", "الأحزاب", "سبأ", "فاطر", "يس", "الصافات", "ص", "الزمر", "غافر", "فصلت", "الشورى", "الزخرف", "الدخان", "الجاثية", "الأحقاف", "محمد", "الفتح", "الحجرات", "ق", "الذاريات", "الطور", "النجم", "القمر", "الرحمن", "الواقعة", "الحديد", "المجادلة", "الحشر", "الممتحنة", "الصف", "الجمعة", "المنافقون", "التغابن", "الطلاق", "التحريم", "المُلك", "القلم", "الحاقّة", "المعارج", "نوح", "الجن", "المزمل", "المدثر", "القيامة", "الإنسان", "المرسلات", "النبأ", "النازعات", "عبس", "التكوير", "الإنفطار", "المطففين", "الإنشقاق", "البروج", "الطارق", "الأعلى", "الغاشية", "الفجر", "البلد", "الشمس", "الليل", "الضحى", "الشرح", "التين", "العلق", "القدر", "البيّنة", "الزلزلة", "العاديات", "القارعة", "التكاثر", "العصر", "الهُمَزة", "الفيل", "قُرَيش", "الماعون", "الكوثر", "الكافرون", "النصر", "المَسَد", "الإخلاص", "الفلق", "الناس"];
    Basmala = "بسمِ اللهِ الرحمنِ الرحيمِ";
    Fateha = "الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ ﴿2﴾ الرَّحْمَٰنِ الرَّحِيمِ ﴿3﴾ مَالِكِ يَوْمِ الدِّينِ ﴿4﴾ إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ ﴿5﴾ اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ ﴿6﴾ صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ ﴿7﴾";
    BaQura_1_5 = "الـم ﴿1﴾ ذَٰلِكَ الْكِتَابُ لَا رَيْبَ ۛ فِيهِ ۛ هُدًى لِلْمُتَّقِينَ ﴿2﴾ الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ الصَّلَاةَ وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ ﴿3﴾ وَالَّذِينَ يُؤْمِنُونَ بِمَا أُنْزِلَ إِلَيْكَ وَمَا أُنْزِلَ مِنْ قَبْلِكَ وَبِالْآخِرَةِ هُمْ يُوقِنُونَ ﴿4﴾ أُولَٰئِكَ عَلَىٰ هُدًى مِنْ رَبِّهِمْ ۖ وَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ ﴿5﴾";
    BaQura_8_9 = "وَمِنَ النَّاسِ مَن يَقُولُ آمَنَّا بِاللَّهِ وَبِالْيَوْمِ الْآخِرِ وَمَا هُم بِمُؤْمِنِينَ ﴿8﴾ يُخَادِعُونَ اللَّهَ وَالَّذِينَ آمَنُوا وَمَا يَخْدَعُونَ إِلَّا أَنْفُسَهُمْ وَمَا يَشْعُرُونَ ﴿9﴾";
    BaQura_102_103 = "وَاتَّبَعُوا مَا تَتْلُو الشَّيَاطِينُ عَلَىٰ مُلْكِ سُلَيْمَانَ ۖ وَمَا كَفَرَ سُلَيْمَانُ وَلَٰكِنَّ الشَّيَاطِينَ كَفَرُوا يُعَلِّمُونَ النَّاسَ السِّحْرَ وَمَا أُنْزِلَ عَلَى الْمَلَكَيْنِ بِبَابِلَ هَارُوتَ وَمَارُوتَ ۚ وَمَا يُعَلِّمَانِ مِنْ أَحَدٍ حَتَّىٰ يَقُولَا إِنَّمَا نَحْنُ فِتْنَةٌ فَلَا تَكْفُرْ ۖ فَيَتَعَلَّمُونَ مِنْهُمَا مَا يُفَرِّقُونَ بِهِ بَيْنَ الْمَرْءِ وَزَوْجِهِ ۚ وَمَا هُمْ بِضَارِّينَ بِهِ مِنْ أَحَدٍ إِلَّا بِإِذْنِ اللَّهِ ۚ وَيَتَعَلَّمُونَ مَا يَضُرُّهُمْ وَلَا يَنْفَعُهُمْ ۚ وَلَقَدْ عَلِمُوا لَمَنِ اشْتَرَاهُ مَا لَهُ فِي الْآخِرَةِ مِنْ خَلَاقٍ ۚ وَلَبِئْسَ مَا شَرَوْا بِهِ أَنْفُسَهُمْ ۚ لَوْ كَانُوا يَعْلَمُونَ ﴿102﴾ وَلَوْ أَنَّهُمْ آمَنُوا وَاتَّقَوْا لَمَثُوبَةٌ مِنْ عِنْدِ اللَّهِ خَيْرٌ ۖ لَوْ كَانُوا يَعْلَمُونَ ﴿103﴾ ";
    BaQura_137 = "فَإِنْ آمَنُوا بِمِثْلِ مَا آمَنْتُمْ بِهِ فَقَدِ اهْتَدَوْا ۖ وَإِنْ تَوَلَّوْا فَإِنَّمَا هُمْ فِي شِقَاقٍ ۖ فَسَيَكْفِيكَهُمُ اللَّهُ ۚ وَهُوَ السَّمِيعُ الْعَلِيمُ ﴿137﴾";
    BaQura_148 = "وَلِكُلٍّ وِجْهَةٌ هُوَ مُوَلِّيهَا ۖ فَاسْتَبِقُوا الْخَيْرَاتِ ۚ أَيْنَ مَا تَكُونُوا يَأْتِ بِكُمُ اللَّهُ جَمِيعًا ۚ إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ ﴿148﴾ ";
    BaQura_163_164 = "وَإِلَٰهُكُمْ إِلَٰهٌ وَاحِدٌ ۖ لَا إِلَٰهَ إِلَّا هُوَ الرَّحْمَٰنُ الرَّحِيمُ ﴿163﴾ إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ وَالْفُلْكِ الَّتِي تَجْرِي فِي الْبَحْرِ بِمَا يَنْفَعُ النَّاسَ وَمَا أَنْزَلَ اللَّهُ مِنَ السَّمَاءِ مِنْ مَاءٍ فَأَحْيَا بِهِ الْأَرْضَ بَعْدَ مَوْتِهَا وَبَثَّ فِيهَا مِنْ كُلِّ دَابَّةٍ وَتَصْرِيفِ الرِّيَاحِ وَالسَّحَابِ الْمُسَخَّرِ بَيْنَ السَّمَاءِ وَالْأَرْضِ لَآيَاتٍ لِقَوْمٍ يَعْقِلُونَ ﴿164﴾";
    BaQura_235_237 = "وَلَا جُنَاحَ عَلَيْكُمْ فِيمَا عَرَّضْتُمْ بِهِ مِنْ خِطْبَةِ النِّسَاءِ أَوْ أَكْنَنْتُمْ فِي أَنْفُسِكُمْ ۚ عَلِمَ اللَّهُ أَنَّكُمْ سَتَذْكُرُونَهُنَّ وَلَٰكِنْ لَا تُوَاعِدُوهُنَّ سِرًّا إِلَّا أَنْ تَقُولُوا قَوْلًا مَعْرُوفًا ۚ وَلَا تَعْزِمُوا عُقْدَةَ النِّكَاحِ حَتَّىٰ يَبْلُغَ الْكِتَابُ أَجَلَهُ ۚ وَاعْلَمُوا أَنَّ اللَّهَ يَعْلَمُ مَا فِي أَنْفُسِكُمْ فَاحْذَرُوهُ ۚ وَاعْلَمُوا أَنَّ اللَّهَ غَفُورٌ حَلِيمٌ ﴿235﴾ لَا جُنَاحَ عَلَيْكُمْ إِنْ طَلَّقْتُمُ النِّسَاءَ مَا لَمْ تَمَسُّوهُنَّ أَوْ تَفْرِضُوا لَهُنَّ فَرِيضَةً ۚ وَمَتِّعُوهُنَّ عَلَى الْمُوسِعِ قَدَرُهُ وَعَلَى الْمُقْتِرِ قَدَرُهُ مَتَاعًا بِالْمَعْرُوفِ ۖ حَقًّا عَلَى الْمُحْسِنِينَ ﴿236﴾ وَإِنْ طَلَّقْتُمُوهُنَّ مِنْ قَبْلِ أَنْ تَمَسُّوهُنَّ وَقَدْ فَرَضْتُمْ لَهُنَّ فَرِيضَةً فَنِصْفُ مَا فَرَضْتُمْ إِلَّا أَنْ يَعْفُونَ أَوْ يَعْفُوَ الَّذِي بِيَدِهِ عُقْدَةُ النِّكَاحِ ۚ وَأَنْ تَعْفُوا أَقْرَبُ لِلتَّقْوَىٰ ۚ وَلَا تَنْسَوُا الْفَضْلَ بَيْنَكُمْ ۚ إِنَّ اللَّهَ بِمَا تَعْمَلُونَ بَصِيرٌ ﴿237﴾";
    ElKorsey = "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ ﴿255﴾";
    BaQura_256_257 = "لَا إِكْرَاهَ فِي الدِّينِ ۖ قَدْ تَبَيَّنَ الرُّشْدُ مِنَ الْغَيِّ ۚ فَمَنْ يَكْفُرْ بِالطَّاغُوتِ وَيُؤْمِنْ بِاللَّهِ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقَىٰ لَا انْفِصَامَ لَهَا ۗ وَاللَّهُ سَمِيعٌ عَلِيمٌ ﴿256﴾ اللَّهُ وَلِيُّ الَّذِينَ آمَنُوا يُخْرِجُهُمْ مِنَ الظُّلُمَاتِ إِلَى النُّورِ ۖ وَالَّذِينَ كَفَرُوا أَوْلِيَاؤُهُمُ الطَّاغُوتُ يُخْرِجُونَهُمْ مِنَ النُّورِ إِلَى الظُّلُمَاتِ ۗ أُولَٰئِكَ أَصْحَابُ النَّارِ ۖ هُمْ فِيهَا خَالِدُونَ ﴿257﴾";
    BaQura_284_End = " لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ وَإِنْ تُبْدُوا مَا فِي أَنْفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُمْ بِهِ اللَّهُ ۖ فَيَغْفِرُ لِمَنْ يَشَاءُ وَيُعَذِّبُ مَنْ يَشَاءُ ۗ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ ﴿284﴾ آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ ﴿285﴾ لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ ﴿286﴾";
    Al_Omran_1_5 = "الـم ﴿1﴾ اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ﴿2﴾ نَزَّلَ عَلَيْكَ الْكِتَابَ بِالْحَقِّ مُصَدِّقًا لِمَا بَيْنَ يَدَيْهِ وَأَنْزَلَ التَّوْرَاةَ وَالْإِنْجِيلَ ﴿3﴾ مِنْ قَبْلُ هُدًى لِلنَّاسِ وَأَنْزَلَ الْفُرْقَانَ ۗ إِنَّ الَّذِينَ كَفَرُوا بِآيَاتِ اللَّهِ لَهُمْ عَذَابٌ شَدِيدٌ ۗ وَاللَّهُ عَزِيزٌ ذُو انْتِقَامٍ ﴿4﴾ إِنَّ اللَّهَ لَا يَخْفَىٰ عَلَيْهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ ﴿5﴾";
    Al_Omran_18_19 = "شَهِدَ اللَّهُ أَنَّهُ لَا إِلَٰهَ إِلَّا هُوَ وَالْمَلَائِكَةُ وَأُولُو الْعِلْمِ قَائِمًا بِالْقِسْطِ ۚ لَا إِلَٰهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ ﴿18﴾ إِنَّ الدِّينَ عِنْدَ اللَّهِ الْإِسْلَامُ ۗ وَمَا اخْتَلَفَ الَّذِينَ أُوتُوا الْكِتَابَ إِلَّا مِنْ بَعْدِ مَا جَاءَهُمُ الْعِلْمُ بَغْيًا بَيْنَهُمْ ۗ وَمَنْ يَكْفُرْ بِآيَاتِ اللَّهِ فَإِنَّ اللَّهَ سَرِيعُ الْحِسَابِ ﴿19﴾";
    Al_Omran_22 = "أُولَٰئِكَ الَّذِينَ حَبِطَتْ أَعْمَالُهُمْ فِي الدُّنْيَا وَالْآخِرَةِ وَمَا لَهُمْ مِنْ نَاصِرِينَ ﴿22﴾";
    Al_Omran_26_27 = "قُلِ اللَّهُمَّ مَالِكَ الْمُلْكِ تُؤْتِي الْمُلْكَ مَنْ تَشَاءُ وَتَنْزِعُ الْمُلْكَ مِمَّنْ تَشَاءُ وَتُعِزُّ مَنْ تَشَاءُ وَتُذِلُّ مَنْ تَشَاءُ ۖ بِيَدِكَ الْخَيْرُ ۖ إِنَّكَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ ﴿26﴾ تُولِجُ اللَّيْلَ فِي النَّهَارِ وَتُولِجُ النَّهَارَ فِي اللَّيْلِ ۖ وَتُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَتُخْرِجُ الْمَيِّتَ مِنَ الْحَيِّ ۖ وَتَرْزُقُ مَنْ تَشَاءُ بِغَيْرِ حِسَابٍ ﴿27﴾";
    Al_Omran_54 = "وَمَكَرُوا وَمَكَرَ اللَّهُ ۖ وَاللَّهُ خَيْرُ الْمَاكِرِينَ ﴿54﴾";
    Al_Omran_111 = "لَنْ يَضُرُّوكُمْ إِلَّا أَذًى ۖ وَإِنْ يُقَاتِلُوكُمْ يُوَلُّوكُمُ الْأَدْبَارَ ثُمَّ لَا يُنْصَرُونَ ﴿111﴾";
    Al_Omran_120 = "إِنْ تَمْسَسْكُمْ حَسَنَةٌ تَسُؤْهُمْ وَإِنْ تُصِبْكُمْ سَيِّئَةٌ يَفْرَحُوا بِهَا ۖ وَإِنْ تَصْبِرُوا وَتَتَّقُوا لَا يَضُرُّكُمْ كَيْدُهُمْ شَيْئًا ۗ إِنَّ اللَّهَ بِمَا يَعْمَلُونَ مُحِيطٌ ﴿120﴾";
    Al_Omran_173_174 = "الَّذِينَ قَالَ لَهُمُ النَّاسُ إِنَّ النَّاسَ قَدْ جَمَعُوا لَكُمْ فَاخْشَوْهُمْ فَزَادَهُمْ إِيمَانًا وَقَالُوا حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ ﴿173﴾ فَانْقَلَبُوا بِنِعْمَةٍ مِنَ اللَّهِ وَفَضْلٍ لَمْ يَمْسَسْهُمْ سُوءٌ وَاتَّبَعُوا رِضْوَانَ اللَّهِ ۗ وَاللَّهُ ذُو فَضْلٍ عَظِيمٍ ﴿174﴾";
    Nesa_45 = "وَاللَّهُ أَعْلَمُ بِأَعْدَائِكُمْ ۚ وَكَفَىٰ بِاللَّهِ وَلِيًّا وَكَفَىٰ بِاللَّهِ نَصِيرًا ﴿45﴾";
    Nesa_54_56 = "أَمْ يَحْسُدُونَ النَّاسَ عَلَىٰ مَا آتَاهُمُ اللَّهُ مِنْ فَضْلِهِ ۖ فَقَدْ آتَيْنَا آلَ إِبْرَاهِيمَ الْكِتَابَ وَالْحِكْمَةَ وَآتَيْنَاهُمْ مُلْكًا عَظِيمًا ﴿54﴾ فَمِنْهُمْ مَنْ آمَنَ بِهِ وَمِنْهُمْ مَنْ صَدَّ عَنْهُ ۚ وَكَفَىٰ بِجَهَنَّمَ سَعِيرًا ﴿55﴾ إِنَّ الَّذِينَ كَفَرُوا بِآيَاتِنَا سَوْفَ نُصْلِيهِمْ نَارًا كُلَّمَا نَضِجَتْ جُلُودُهُمْ بَدَّلْنَاهُمْ جُلُودًا غَيْرَهَا لِيَذُوقُوا الْعَذَابَ ۗ إِنَّ اللَّهَ كَانَ عَزِيزًا حَكِيمًا ﴿56﴾";
    Nesa_81 = "وَيَقُولُونَ طَاعَةٌ فَإِذَا بَرَزُوا مِنْ عِنْدِكَ بَيَّتَ طَائِفَةٌ مِنْهُمْ غَيْرَ الَّذِي تَقُولُ ۖ وَاللَّهُ يَكْتُبُ مَا يُبَيِّتُونَ ۖ فَأَعْرِضْ عَنْهُمْ وَتَوَكَّلْ عَلَى اللَّهِ ۚ وَكَفَىٰ بِاللَّهِ وَكِيلًا ﴿81﴾";
    Nesa_126 = "وَلِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۚ وَكَانَ اللَّهُ بِكُلِّ شَيْءٍ مُحِيطًا ﴿126﴾";
    Nesa_145 = "إِنَّ الْمُنَافِقِينَ فِي الدَّرْكِ الْأَسْفَلِ مِنَ النَّارِ وَلَنْ تَجِدَ لَهُمْ نَصِيرًا ﴿145﴾";
    Nesa_167_170 = "إِنَّ الَّذِينَ كَفَرُوا وَصَدُّوا عَنْ سَبِيلِ اللَّهِ قَدْ ضَلُّوا ضَلَالًا بَعِيدًا ﴿167﴾ إِنَّ الَّذِينَ كَفَرُوا وَظَلَمُوا لَمْ يَكُنِ اللَّهُ لِيَغْفِرَ لَهُمْ وَلَا لِيَهْدِيَهُمْ طَرِيقًا ﴿168﴾ إِلَّا طَرِيقَ جَهَنَّمَ خَالِدِينَ فِيهَا أَبَدًا ۚ وَكَانَ ذَٰلِكَ عَلَى اللَّهِ يَسِيرًا ﴿169﴾ يَا أَيُّهَا النَّاسُ قَدْ جَاءَكُمُ الرَّسُولُ بِالْحَقِّ مِنْ رَبِّكُمْ فَآمِنُوا خَيْرًا لَكُمْ ۚ وَإِنْ تَكْفُرُوا فَإِنَّ لِلَّهِ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۚ وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا ﴿170﴾";
    Maeda_6 = "يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ وَامْسَحُوا بِرُءُوسِكُمْ وَأَرْجُلَكُمْ إِلَى الْكَعْبَيْنِ ۚ وَإِنْ كُنْتُمْ جُنُبًا فَاطَّهَّرُوا ۚ وَإِنْ كُنْتُمْ مَرْضَىٰ أَوْ عَلَىٰ سَفَرٍ أَوْ جَاءَ أَحَدٌ مِنْكُمْ مِنَ الْغَائِطِ أَوْ لَامَسْتُمُ النِّسَاءَ فَلَمْ تَجِدُوا مَاءً فَتَيَمَّمُوا صَعِيدًا طَيِّبًا فَامْسَحُوا بِوُجُوهِكُمْ وَأَيْدِيكُمْ مِنْهُ ۚ مَا يُرِيدُ اللَّهُ لِيَجْعَلَ عَلَيْكُمْ مِنْ حَرَجٍ وَلَٰكِنْ يُرِيدُ لِيُطَهِّرَكُمْ وَلِيُتِمَّ نِعْمَتَهُ عَلَيْكُمْ لَعَلَّكُمْ تَشْكُرُونَ ﴿6﴾";
    Maeda_11 = "يَا أَيُّهَا الَّذِينَ آمَنُوا اذْكُرُوا نِعْمَتَ اللَّهِ عَلَيْكُمْ إِذْ هَمَّ قَوْمٌ أَنْ يَبْسُطُوا إِلَيْكُمْ أَيْدِيَهُمْ فَكَفَّ أَيْدِيَهُمْ عَنْكُمْ ۖ وَاتَّقُوا اللَّهَ ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ ﴿11﴾";
    Maeda_23 = "قَالَ رَجُلَانِ مِنَ الَّذِينَ يَخَافُونَ أَنْعَمَ اللَّهُ عَلَيْهِمَا ادْخُلُوا عَلَيْهِمُ الْبَابَ فَإِذَا دَخَلْتُمُوهُ فَإِنَّكُمْ غَالِبُونَ ۚ وَعَلَى اللَّهِ فَتَوَكَّلُوا إِنْ كُنْتُمْ مُؤْمِنِينَ ﴿23﴾";
    Maeda_33_37 = "إِنَّمَا جَزَاءُ الَّذِينَ يُحَارِبُونَ اللَّهَ وَرَسُولَهُ وَيَسْعَوْنَ فِي الْأَرْضِ فَسَادًا أَنْ يُقَتَّلُوا أَوْ يُصَلَّبُوا أَوْ تُقَطَّعَ أَيْدِيهِمْ وَأَرْجُلُهُمْ مِنْ خِلَافٍ أَوْ يُنْفَوْا مِنَ الْأَرْضِ ۚ ذَٰلِكَ لَهُمْ خِزْيٌ فِي الدُّنْيَا ۖ وَلَهُمْ فِي الْآخِرَةِ عَذَابٌ عَظِيمٌ ﴿33﴾ إِلَّا الَّذِينَ تَابُوا مِنْ قَبْلِ أَنْ تَقْدِرُوا عَلَيْهِمْ ۖ فَاعْلَمُوا أَنَّ اللَّهَ غَفُورٌ رَحِيمٌ ﴿34﴾ يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَابْتَغُوا إِلَيْهِ الْوَسِيلَةَ وَجَاهِدُوا فِي سَبِيلِهِ لَعَلَّكُمْ تُفْلِحُونَ ﴿35﴾ إِنَّ الَّذِينَ كَفَرُوا لَوْ أَنَّ لَهُمْ مَا فِي الْأَرْضِ جَمِيعًا وَمِثْلَهُ مَعَهُ لِيَفْتَدُوا بِهِ مِنْ عَذَابِ يَوْمِ الْقِيَامَةِ مَا تُقُبِّلَ مِنْهُمْ ۖ وَلَهُمْ عَذَابٌ أَلِيمٌ ﴿36﴾ يُرِيدُونَ أَنْ يَخْرُجُوا مِنَ النَّارِ وَمَا هُمْ بِخَارِجِينَ مِنْهَا ۖ وَلَهُمْ عَذَابٌ مُقِيمٌ ﴿37﴾";
    Maeda_42 = "سَمَّاعُونَ لِلْكَذِبِ أَكَّالُونَ لِلسُّحْتِ ۚ فَإِنْ جَاءُوكَ فَاحْكُمْ بَيْنَهُمْ أَوْ أَعْرِضْ عَنْهُمْ ۖ وَإِنْ تُعْرِضْ عَنْهُمْ فَلَنْ يَضُرُّوكَ شَيْئًا ۖ وَإِنْ حَكَمْتَ فَاحْكُمْ بَيْنَهُمْ بِالْقِسْطِ ۚ إِنَّ اللَّهَ يُحِبُّ الْمُقْسِطِينَ ﴿42﴾";
    Maeda_66 = "وَلَوْ أَنَّهُمْ أَقَامُوا التَّوْرَاةَ وَالْإِنْجِيلَ وَمَا أُنْزِلَ إِلَيْهِمْ مِنْ رَبِّهِمْ لَأَكَلُوا مِنْ فَوْقِهِمْ وَمِنْ تَحْتِ أَرْجُلِهِمْ ۚ مِنْهُمْ أُمَّةٌ مُقْتَصِدَةٌ ۖ وَكَثِيرٌ مِنْهُمْ سَاءَ مَا يَعْمَلُونَ ﴿66﴾";
    Anaam_7 = "وَلَوْ نَزَّلْنَا عَلَيْكَ كِتَابًا فِي قِرْطَاسٍ فَلَمَسُوهُ بِأَيْدِيهِمْ لَقَالَ الَّذِينَ كَفَرُوا إِنْ هَٰذَا إِلَّا سِحْرٌ مُبِينٌ ﴿7﴾";
    Anaam_17 = "وَإِنْ يَمْسَسْكَ اللَّهُ بِضُرٍّ فَلَا كَاشِفَ لَهُ إِلَّا هُوَ ۖ وَإِنْ يَمْسَسْكَ بِخَيْرٍ فَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ ﴿17﴾";
    Anaam_61 = "وَهُوَ الْقَاهِرُ فَوْقَ عِبَادِهِ ۖ وَيُرْسِلُ عَلَيْكُمْ حَفَظَةً حَتَّىٰ إِذَا جَاءَ أَحَدَكُمُ الْمَوْتُ تَوَفَّتْهُ رُسُلُنَا وَهُمْ لَا يُفَرِّطُونَ ﴿61﴾";
    Anaam_65 = "قُلْ هُوَ الْقَادِرُ عَلَىٰ أَنْ يَبْعَثَ عَلَيْكُمْ عَذَابًا مِنْ فَوْقِكُمْ أَوْ مِنْ تَحْتِ أَرْجُلِكُمْ أَوْ يَلْبِسَكُمْ شِيَعًا وَيُذِيقَ بَعْضَكُمْ بَأْسَ بَعْضٍ ۗ انْظُرْ كَيْفَ نُصَرِّفُ الْآيَاتِ لَعَلَّهُمْ يَفْقَهُونَ ﴿65﴾";
    Anaam_124 = "وَإِذَا جَاءَتْهُمْ آيَةٌ قَالُوا لَنْ نُؤْمِنَ حَتَّىٰ نُؤْتَىٰ مِثْلَ مَا أُوتِيَ رُسُلُ اللَّهِ ۘ اللَّهُ أَعْلَمُ حَيْثُ يَجْعَلُ رِسَالَتَهُ ۗ سَيُصِيبُ الَّذِينَ أَجْرَمُوا صَغَارٌ عِنْدَ اللَّهِ وَعَذَابٌ شَدِيدٌ بِمَا كَانُوا يَمْكُرُونَ ﴿124﴾";
    Anaam_128_134 = "وَيَوْمَ يَحْشُرُهُمْ جَمِيعًا يَا مَعْشَرَ الْجِنِّ قَدِ اسْتَكْثَرْتُمْ مِنَ الْإِنْسِ ۖ وَقَالَ أَوْلِيَاؤُهُمْ مِنَ الْإِنْسِ رَبَّنَا اسْتَمْتَعَ بَعْضُنَا بِبَعْضٍ وَبَلَغْنَا أَجَلَنَا الَّذِي أَجَّلْتَ لَنَا ۚ قَالَ النَّارُ مَثْوَاكُمْ خَالِدِينَ فِيهَا إِلَّا مَا شَاءَ اللَّهُ ۗ إِنَّ رَبَّكَ حَكِيمٌ عَلِيمٌ ﴿128﴾ وَكَذَٰلِكَ نُوَلِّي بَعْضَ الظَّالِمِينَ بَعْضًا بِمَا كَانُوا يَكْسِبُونَ ﴿129﴾ يَا مَعْشَرَ الْجِنِّ وَالْإِنْسِ أَلَمْ يَأْتِكُمْ رُسُلٌ مِنْكُمْ يَقُصُّونَ عَلَيْكُمْ آيَاتِي وَيُنْذِرُونَكُمْ لِقَاءَ يَوْمِكُمْ هَٰذَا ۚ قَالُوا شَهِدْنَا عَلَىٰ أَنْفُسِنَا ۖ وَغَرَّتْهُمُ الْحَيَاةُ الدُّنْيَا وَشَهِدُوا عَلَىٰ أَنْفُسِهِمْ أَنَّهُمْ كَانُوا كَافِرِينَ ﴿130﴾ ذَٰلِكَ أَنْ لَمْ يَكُنْ رَبُّكَ مُهْلِكَ الْقُرَىٰ بِظُلْمٍ وَأَهْلُهَا غَافِلُونَ ﴿131﴾ وَلِكُلٍّ دَرَجَاتٌ مِمَّا عَمِلُوا ۚ وَمَا رَبُّكَ بِغَافِلٍ عَمَّا يَعْمَلُونَ ﴿132﴾ وَرَبُّكَ الْغَنِيُّ ذُو الرَّحْمَةِ ۚ إِنْ يَشَأْ يُذْهِبْكُمْ وَيَسْتَخْلِفْ مِنْ بَعْدِكُمْ مَا يَشَاءُ كَمَا أَنْشَأَكُمْ مِنْ ذُرِّيَّةِ قَوْمٍ آخَرِينَ ﴿133﴾ إِنَّ مَا تُوعَدُونَ لَآتٍ ۖ وَمَا أَنْتُمْ بِمُعْجِزِينَ ﴿134﴾";
    Aaraf_54_56 = "إِنَّ رَبَّكُمُ اللَّهُ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ فِي سِتَّةِ أَيَّامٍ ثُمَّ اسْتَوَىٰ عَلَى الْعَرْشِ يُغْشِي اللَّيْلَ النَّهَارَ يَطْلُبُهُ حَثِيثًا وَالشَّمْسَ وَالْقَمَرَ وَالنُّجُومَ مُسَخَّرَاتٍ بِأَمْرِهِ ۗ أَلَا لَهُ الْخَلْقُ وَالْأَمْرُ ۗ تَبَارَكَ اللَّهُ رَبُّ الْعَالَمِينَ ﴿54﴾ ادْعُوا رَبَّكُمْ تَضَرُّعًا وَخُفْيَةً ۚ إِنَّهُ لَا يُحِبُّ الْمُعْتَدِينَ ﴿55﴾ وَلَا تُفْسِدُوا فِي الْأَرْضِ بَعْدَ إِصْلَاحِهَا وَادْعُوهُ خَوْفًا وَطَمَعًا ۚ إِنَّ رَحْمَتَ اللَّهِ قَرِيبٌ مِنَ الْمُحْسِنِينَ ﴿56﴾";
    Aaraf_104_122 = "وَقَالَ مُوسَىٰ يَا فِرْعَوْنُ إِنِّي رَسُولٌ مِنْ رَبِّ الْعَالَمِينَ ﴿104﴾ حَقِيقٌ عَلَىٰ أَنْ لَا أَقُولَ عَلَى اللَّهِ إِلَّا الْحَقَّ ۚ قَدْ جِئْتُكُمْ بِبَيِّنَةٍ مِنْ رَبِّكُمْ فَأَرْسِلْ مَعِيَ بَنِي إِسْرَائِيلَ ﴿105﴾ قَالَ إِنْ كُنْتَ جِئْتَ بِآيَةٍ فَأْتِ بِهَا إِنْ كُنْتَ مِنَ الصَّادِقِينَ ﴿106﴾ فَأَلْقَىٰ عَصَاهُ فَإِذَا هِيَ ثُعْبَانٌ مُبِينٌ ﴿107﴾ وَنَزَعَ يَدَهُ فَإِذَا هِيَ بَيْضَاءُ لِلنَّاظِرِينَ ﴿108﴾ قَالَ الْمَلَأُ مِنْ قَوْمِ فِرْعَوْنَ إِنَّ هَٰذَا لَسَاحِرٌ عَلِيمٌ ﴿109﴾ يُرِيدُ أَنْ يُخْرِجَكُمْ مِنْ أَرْضِكُمْ ۖ فَمَاذَا تَأْمُرُونَ ﴿110﴾ قَالُوا أَرْجِهْ وَأَخَاهُ وَأَرْسِلْ فِي الْمَدَائِنِ حَاشِرِينَ ﴿111﴾ يَأْتُوكَ بِكُلِّ سَاحِرٍ عَلِيمٍ ﴿112﴾ وَجَاءَ السَّحَرَةُ فِرْعَوْنَ قَالُوا إِنَّ لَنَا لَأَجْرًا إِنْ كُنَّا نَحْنُ الْغَالِبِينَ ﴿113﴾ قَالَ نَعَمْ وَإِنَّكُمْ لَمِنَ الْمُقَرَّبِينَ ﴿114﴾ قَالُوا يَا مُوسَىٰ إِمَّا أَنْ تُلْقِيَ وَإِمَّا أَنْ نَكُونَ نَحْنُ الْمُلْقِينَ ﴿115﴾ قَالَ أَلْقُوا ۖ فَلَمَّا أَلْقَوْا سَحَرُوا أَعْيُنَ النَّاسِ وَاسْتَرْهَبُوهُمْ وَجَاءُوا بِسِحْرٍ عَظِيمٍ ﴿116﴾ وَأَوْحَيْنَا إِلَىٰ مُوسَىٰ أَنْ أَلْقِ عَصَاكَ ۖ فَإِذَا هِيَ تَلْقَفُ مَا يَأْفِكُونَ ﴿117﴾ فَوَقَعَ الْحَقُّ وَبَطَلَ مَا كَانُوا يَعْمَلُونَ ﴿118﴾ فَغُلِبُوا هُنَالِكَ وَانْقَلَبُوا صَاغِرِينَ ﴿119﴾ وَأُلْقِيَ السَّحَرَةُ سَاجِدِينَ ﴿120﴾ قَالُوا آمَنَّا بِرَبِّ الْعَالَمِينَ ﴿121﴾ رَبِّ مُوسَىٰ وَهَارُونَ ﴿122﴾";
    Aaraf_123_126 = "قَالَ فِرْعَوْنُ آمَنْتُمْ بِهِ قَبْلَ أَنْ آذَنَ لَكُمْ ۖ إِنَّ هَٰذَا لَمَكْرٌ مَكَرْتُمُوهُ فِي الْمَدِينَةِ لِتُخْرِجُوا مِنْهَا أَهْلَهَا ۖ فَسَوْفَ تَعْلَمُونَ ﴿123﴾ لَأُقَطِّعَنَّ أَيْدِيَكُمْ وَأَرْجُلَكُمْ مِنْ خِلَافٍ ثُمَّ لَأُصَلِّبَنَّكُمْ أَجْمَعِينَ ﴿124﴾ قَالُوا إِنَّا إِلَىٰ رَبِّنَا مُنْقَلِبُونَ ﴿125﴾ وَمَا تَنْقِمُ مِنَّا إِلَّا أَنْ آمَنَّا بِآيَاتِ رَبِّنَا لَمَّا جَاءَتْنَا ۚ رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ ﴿126﴾";
    Aaraf_132 = "وَقَالُوا مَهْمَا تَأْتِنَا بِهِ مِنْ آيَةٍ لِتَسْحَرَنَا بِهَا فَمَا نَحْنُ لَكَ بِمُؤْمِنِينَ ﴿132﴾";
    Aaraf_139 = "إِنَّ هَٰؤُلَاءِ مُتَبَّرٌ مَا هُمْ فِيهِ وَبَاطِلٌ مَا كَانُوا يَعْمَلُونَ ﴿139﴾";
    Aaraf_147 = "وَالَّذِينَ كَذَّبُوا بِآيَاتِنَا وَلِقَاءِ الْآخِرَةِ حَبِطَتْ أَعْمَالُهُمْ ۚ هَلْ يُجْزَوْنَ إِلَّا مَا كَانُوا يَعْمَلُونَ ﴿147﴾";
    Aaraf_195 = "أَلَهُمْ أَرْجُلٌ يَمْشُونَ بِهَا ۖ أَمْ لَهُمْ أَيْدٍ يَبْطِشُونَ بِهَا ۖ أَمْ لَهُمْ أَعْيُنٌ يُبْصِرُونَ بِهَا ۖ أَمْ لَهُمْ آذَانٌ يَسْمَعُونَ بِهَا ۗ قُلِ ادْعُوا شُرَكَاءَكُمْ ثُمَّ كِيدُونِ فَلَا تُنْظِرُونِ ﴿195﴾";
    Anfal_7_8 = "وَإِذْ يَعِدُكُمُ اللَّهُ إِحْدَى الطَّائِفَتَيْنِ أَنَّهَا لَكُمْ وَتَوَدُّونَ أَنَّ غَيْرَ ذَاتِ الشَّوْكَةِ تَكُونُ لَكُمْ وَيُرِيدُ اللَّهُ أَنْ يُحِقَّ الْحَقَّ بِكَلِمَاتِهِ وَيَقْطَعَ دَابِرَ الْكَافِرِينَ ﴿7﴾ لِيُحِقَّ الْحَقَّ وَيُبْطِلَ الْبَاطِلَ وَلَوْ كَرِهَ الْمُجْرِمُونَ ﴿8﴾";
    Anfal_12_14 = "إِذْ يُوحِي رَبُّكَ إِلَى الْمَلَائِكَةِ أَنِّي مَعَكُمْ فَثَبِّتُوا الَّذِينَ آمَنُوا ۚ سَأُلْقِي فِي قُلُوبِ الَّذِينَ كَفَرُوا الرُّعْبَ فَاضْرِبُوا فَوْقَ الْأَعْنَاقِ وَاضْرِبُوا مِنْهُمْ كُلَّ بَنَانٍ ﴿12﴾ ذَٰلِكَ بِأَنَّهُمْ شَاقُّوا اللَّهَ وَرَسُولَهُ ۚ وَمَنْ يُشَاقِقِ اللَّهَ وَرَسُولَهُ فَإِنَّ اللَّهَ شَدِيدُ الْعِقَابِ ﴿13﴾ ذَٰلِكُمْ فَذُوقُوهُ وَأَنَّ لِلْكَافِرِينَ عَذَابَ النَّارِ ﴿14﴾";
    Anfal_17_19 = "فَلَمْ تَقْتُلُوهُمْ وَلَٰكِنَّ اللَّهَ قَتَلَهُمْ ۚ وَمَا رَمَيْتَ إِذْ رَمَيْتَ وَلَٰكِنَّ اللَّهَ رَمَىٰ ۚ وَلِيُبْلِيَ الْمُؤْمِنِينَ مِنْهُ بَلَاءً حَسَنًا ۚ إِنَّ اللَّهَ سَمِيعٌ عَلِيمٌ ﴿17﴾ ذَٰلِكُمْ وَأَنَّ اللَّهَ مُوهِنُ كَيْدِ الْكَافِرِينَ ﴿18﴾ إِنْ تَسْتَفْتِحُوا فَقَدْ جَاءَكُمُ الْفَتْحُ ۖ وَإِنْ تَنْتَهُوا فَهُوَ خَيْرٌ لَكُمْ ۖ وَإِنْ تَعُودُوا نَعُدْ وَلَنْ تُغْنِيَ عَنْكُمْ فِئَتُكُمْ شَيْئًا وَلَوْ كَثُرَتْ وَأَنَّ اللَّهَ مَعَ الْمُؤْمِنِينَ ﴿19﴾";
    Anfal_30 = "وَإِذْ يَمْكُرُ بِكَ الَّذِينَ كَفَرُوا لِيُثْبِتُوكَ أَوْ يَقْتُلُوكَ أَوْ يُخْرِجُوكَ ۚ وَيَمْكُرُونَ وَيَمْكُرُ اللَّهُ ۖ وَاللَّهُ خَيْرُ الْمَاكِرِينَ ﴿30﴾";
    Anfal_50_52 = "وَلَوْ تَرَىٰ إِذْ يَتَوَفَّى الَّذِينَ كَفَرُوا ۙ الْمَلَائِكَةُ يَضْرِبُونَ وُجُوهَهُمْ وَأَدْبَارَهُمْ وَذُوقُوا عَذَابَ الْحَرِيقِ ﴿50﴾ ذَٰلِكَ بِمَا قَدَّمَتْ أَيْدِيكُمْ وَأَنَّ اللَّهَ لَيْسَ بِظَلَّامٍ لِلْعَبِيدِ ﴿51﴾ كَدَأْبِ آلِ فِرْعَوْنَ ۙ وَالَّذِينَ مِنْ قَبْلِهِمْ ۚ كَفَرُوا بِآيَاتِ اللَّهِ فَأَخَذَهُمُ اللَّهُ بِذُنُوبِهِمْ ۗ إِنَّ اللَّهَ قَوِيٌّ شَدِيدُ الْعِقَابِ ﴿52﴾";
    Taoba_14_15 = "قَاتِلُوهُمْ يُعَذِّبْهُمُ اللَّهُ بِأَيْدِيكُمْ وَيُخْزِهِمْ وَيَنْصُرْكُمْ عَلَيْهِمْ وَيَشْفِ صُدُورَ قَوْمٍ مُؤْمِنِينَ ﴿14﴾ وَيُذْهِبْ غَيْظَ قُلُوبِهِمْ ۗ وَيَتُوبُ اللَّهُ عَلَىٰ مَنْ يَشَاءُ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ ﴿15﴾";
    Taoba_51 = "قُلْ لَنْ يُصِيبَنَا إِلَّا مَا كَتَبَ اللَّهُ لَنَا هُوَ مَوْلَانَا ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ ﴿51﴾";
    Taoba_129 = "فَإِنْ تَوَلَّوْا فَقُلْ حَسْبِيَ اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ ۖ عَلَيْهِ تَوَكَّلْتُ ۖ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ ﴿129﴾";
    Younes_2 = "أَكَانَ لِلنَّاسِ عَجَبًا أَنْ أَوْحَيْنَا إِلَىٰ رَجُلٍ مِنْهُمْ أَنْ أَنْذِرِ النَّاسَ وَبَشِّرِ الَّذِينَ آمَنُوا أَنَّ لَهُمْ قَدَمَ صِدْقٍ عِنْدَ رَبِّهِمْ ۗ قَالَ الْكَافِرُونَ إِنَّ هَٰذَا لَسَاحِرٌ مُبِينٌ ﴿2﴾";
    Younes_57_58 = "يَا أَيُّهَا النَّاسُ قَدْ جَاءَتْكُمْ مَوْعِظَةٌ مِنْ رَبِّكُمْ وَشِفَاءٌ لِمَا فِي الصُّدُورِ وَهُدًى وَرَحْمَةٌ لِلْمُؤْمِنِينَ ﴿57﴾ قُلْ بِفَضْلِ اللَّهِ وَبِرَحْمَتِهِ فَبِذَٰلِكَ فَلْيَفْرَحُوا هُوَ خَيْرٌ مِمَّا يَجْمَعُونَ ﴿58﴾";
    Younes_61 = "وَمَا تَكُونُ فِي شَأْنٍ وَمَا تَتْلُو مِنْهُ مِنْ قُرْآنٍ وَلَا تَعْمَلُونَ مِنْ عَمَلٍ إِلَّا كُنَّا عَلَيْكُمْ شُهُودًا إِذْ تُفِيضُونَ فِيهِ ۚ وَمَا يَعْزُبُ عَنْ رَبِّكَ مِنْ مِثْقَالِ ذَرَّةٍ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَلَا أَصْغَرَ مِنْ ذَٰلِكَ وَلَا أَكْبَرَ إِلَّا فِي كِتَابٍ مُبِينٍ ﴿61﴾";
    Younes_76 = "فَلَمَّا جَاءَهُمُ الْحَقُّ مِنْ عِنْدِنَا قَالُوا إِنَّ هَٰذَا لَسِحْرٌ مُبِينٌ ﴿76﴾";
    Younes_77_82 = "قَالَ مُوسَىٰ أَتَقُولُونَ لِلْحَقِّ لَمَّا جَاءَكُمْ ۖ أَسِحْرٌ هَٰذَا وَلَا يُفْلِحُ السَّاحِرُونَ ﴿77﴾ قَالُوا أَجِئْتَنَا لِتَلْفِتَنَا عَمَّا وَجَدْنَا عَلَيْهِ آبَاءَنَا وَتَكُونَ لَكُمَا الْكِبْرِيَاءُ فِي الْأَرْضِ وَمَا نَحْنُ لَكُمَا بِمُؤْمِنِينَ ﴿78﴾ وَقَالَ فِرْعَوْنُ ائْتُونِي بِكُلِّ سَاحِرٍ عَلِيمٍ ﴿79﴾ فَلَمَّا جَاءَ السَّحَرَةُ قَالَ لَهُمْ مُوسَىٰ أَلْقُوا مَا أَنْتُمْ مُلْقُونَ ﴿80﴾ فَلَمَّا أَلْقَوْا قَالَ مُوسَىٰ مَا جِئْتُمْ بِهِ السِّحْرُ ۖ إِنَّ اللَّهَ سَيُبْطِلُهُ ۖ إِنَّ اللَّهَ لَا يُصْلِحُ عَمَلَ الْمُفْسِدِينَ ﴿81﴾ وَيُحِقُّ اللَّهُ الْحَقَّ بِكَلِمَاتِهِ وَلَوْ كَرِهَ الْمُجْرِمُونَ ﴿82﴾";
    Younes_85 = "فَقَالُوا عَلَى اللَّهِ تَوَكَّلْنَا رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِلْقَوْمِ الظَّالِمِينَ ﴿85﴾";
    Younes_107 = "وَإِنْ يَمْسَسْكَ اللَّهُ بِضُرٍّ فَلَا كَاشِفَ لَهُ إِلَّا هُوَ ۖ وَإِنْ يُرِدْكَ بِخَيْرٍ فَلَا رَادَّ لِفَضْلِهِ ۚ يُصِيبُ بِهِ مَنْ يَشَاءُ مِنْ عِبَادِهِ ۚ وَهُوَ الْغَفُورُ الرَّحِيمُ ﴿107﴾";
    Hood_7 = "وَهُوَ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ فِي سِتَّةِ أَيَّامٍ وَكَانَ عَرْشُهُ عَلَى الْمَاءِ لِيَبْلُوَكُمْ أَيُّكُمْ أَحْسَنُ عَمَلًا ۗ وَلَئِنْ قُلْتَ إِنَّكُمْ مَبْعُوثُونَ مِنْ بَعْدِ الْمَوْتِ لَيَقُولَنَّ الَّذِينَ كَفَرُوا إِنْ هَٰذَا إِلَّا سِحْرٌ مُبِينٌ ﴿7﴾";
    Hood_16 = "أُولَٰئِكَ الَّذِينَ لَيْسَ لَهُمْ فِي الْآخِرَةِ إِلَّا النَّارُ ۖ وَحَبِطَ مَا صَنَعُوا فِيهَا وَبَاطِلٌ مَا كَانُوا يَعْمَلُونَ ﴿16﴾";
    Hood_46 = "قَالَ يَا نُوحُ إِنَّهُ لَيْسَ مِنْ أَهْلِكَ ۖ إِنَّهُ عَمَلٌ غَيْرُ صَالِحٍ ۖ فَلَا تَسْأَلْنِ مَا لَيْسَ لَكَ بِهِ عِلْمٌ ۖ إِنِّي أَعِظُكَ أَنْ تَكُونَ مِنَ الْجَاهِلِينَ ﴿46﴾";
    Hood_56_57 = "إِنِّي تَوَكَّلْتُ عَلَى اللَّهِ رَبِّي وَرَبِّكُمْ ۚ مَا مِنْ دَابَّةٍ إِلَّا هُوَ آخِذٌ بِنَاصِيَتِهَا ۚ إِنَّ رَبِّي عَلَىٰ صِرَاطٍ مُسْتَقِيمٍ ﴿56﴾ فَإِنْ تَوَلَّوْا فَقَدْ أَبْلَغْتُكُمْ مَا أُرْسِلْتُ بِهِ إِلَيْكُمْ ۚ وَيَسْتَخْلِفُ رَبِّي قَوْمًا غَيْرَكُمْ وَلَا تَضُرُّونَهُ شَيْئًا ۚ إِنَّ رَبِّي عَلَىٰ كُلِّ شَيْءٍ حَفِيظٌ ﴿57﴾";
    Hood_88 = "قَالَ يَا قَوْمِ أَرَأَيْتُمْ إِنْ كُنْتُ عَلَىٰ بَيِّنَةٍ مِنْ رَبِّي وَرَزَقَنِي مِنْهُ رِزْقًا حَسَنًا ۚ وَمَا أُرِيدُ أَنْ أُخَالِفَكُمْ إِلَىٰ مَا أَنْهَاكُمْ عَنْهُ ۚ إِنْ أُرِيدُ إِلَّا الْإِصْلَاحَ مَا اسْتَطَعْتُ ۚ وَمَا تَوْفِيقِي إِلَّا بِاللَّهِ ۚ عَلَيْهِ تَوَكَّلْتُ وَإِلَيْهِ أُنِيبُ ﴿88﴾";
    Hood_92 = "قَالَ يَا قَوْمِ أَرَهْطِي أَعَزُّ عَلَيْكُمْ مِنَ اللَّهِ وَاتَّخَذْتُمُوهُ وَرَاءَكُمْ ظِهْرِيًّا ۖ إِنَّ رَبِّي بِمَا تَعْمَلُونَ مُحِيطٌ ﴿92﴾";
    Yousef_64 = "قَالَ هَلْ آمَنُكُمْ عَلَيْهِ إِلَّا كَمَا أَمِنْتُكُمْ عَلَىٰ أَخِيهِ مِنْ قَبْلُ ۖ فَاللَّهُ خَيْرٌ حَافِظًا ۖ وَهُوَ أَرْحَمُ الرَّاحِمِينَ ﴿64﴾";
    Yousef_67 = "وَقَالَ يَا بَنِيَّ لَا تَدْخُلُوا مِنْ بَابٍ وَاحِدٍ وَادْخُلُوا مِنْ أَبْوَابٍ مُتَفَرِّقَةٍ ۖ وَمَا أُغْنِي عَنْكُمْ مِنَ اللَّهِ مِنْ شَيْءٍ ۖ إِنِ الْحُكْمُ إِلَّا لِلَّهِ ۖ عَلَيْهِ تَوَكَّلْتُ ۖ وَعَلَيْهِ فَلْيَتَوَكَّلِ الْمُتَوَكِّلُونَ ﴿67﴾";
    Ra3d_11 = "لَهُ مُعَقِّبَاتٌ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ يَحْفَظُونَهُ مِنْ أَمْرِ اللَّهِ ۗ إِنَّ اللَّهَ لَا يُغَيِّرُ مَا بِقَوْمٍ حَتَّىٰ يُغَيِّرُوا مَا بِأَنْفُسِهِمْ ۗ وَإِذَا أَرَادَ اللَّهُ بِقَوْمٍ سُوءًا فَلَا مَرَدَّ لَهُ ۚ وَمَا لَهُمْ مِنْ دُونِهِ مِنْ وَالٍ ﴿11﴾";
    Ibrahim_12 = "وَمَا لَنَا أَلَّا نَتَوَكَّلَ عَلَى اللَّهِ وَقَدْ هَدَانَا سُبُلَنَا ۚ وَلَنَصْبِرَنَّ عَلَىٰ مَا آذَيْتُمُونَا ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُتَوَكِّلُونَ ﴿12﴾";
    Ibrahim_15_17 = "وَاسْتَفْتَحُوا وَخَابَ كُلُّ جَبَّارٍ عَنِيدٍ ﴿15﴾ مِنْ وَرَائِهِ جَهَنَّمُ وَيُسْقَىٰ مِنْ مَاءٍ صَدِيدٍ ﴿16﴾ يَتَجَرَّعُهُ وَلَا يَكَادُ يُسِيغُهُ وَيَأْتِيهِ الْمَوْتُ مِنْ كُلِّ مَكَانٍ وَمَا هُوَ بِمَيِّتٍ ۖ وَمِنْ وَرَائِهِ عَذَابٌ غَلِيظٌ ﴿17﴾";
    Ibrahim_18 = "مَثَلُ الَّذِينَ كَفَرُوا بِرَبِّهِمْ ۖ أَعْمَالُهُمْ كَرَمَادٍ اشْتَدَّتْ بِهِ الرِّيحُ فِي يَوْمٍ عَاصِفٍ ۖ لَا يَقْدِرُونَ مِمَّا كَسَبُوا عَلَىٰ شَيْءٍ ۚ ذَٰلِكَ هُوَ الضَّلَالُ الْبَعِيدُ ﴿18﴾";
    Ibrahim_49_51 = "وَتَرَى الْمُجْرِمِينَ يَوْمَئِذٍ مُقَرَّنِينَ فِي الْأَصْفَادِ ﴿49﴾ سَرَابِيلُهُمْ مِنْ قَطِرَانٍ وَتَغْشَىٰ وُجُوهَهُمُ النَّارُ ﴿50﴾ لِيَجْزِيَ اللَّهُ كُلَّ نَفْسٍ مَا كَسَبَتْ ۚ إِنَّ اللَّهَ سَرِيعُ الْحِسَابِ ﴿51﴾";
    Hegr_14_15 = "وَلَوْ فَتَحْنَا عَلَيْهِمْ بَابًا مِنَ السَّمَاءِ فَظَلُّوا فِيهِ يَعْرُجُونَ ﴿14﴾ لَقَالُوا إِنَّمَا سُكِّرَتْ أَبْصَارُنَا بَلْ نَحْنُ قَوْمٌ مَسْحُورُونَ ﴿15﴾";
    Hegr_17 = "وَحَفِظْنَاهَا مِنْ كُلِّ شَيْطَانٍ رَجِيمٍ ﴿17﴾";
    Hegr_34_35 = "قَالَ فَاخْرُجْ مِنْهَا فَإِنَّكَ رَجِيمٌ ﴿34﴾ وَإِنَّ عَلَيْكَ اللَّعْنَةَ إِلَىٰ يَوْمِ الدِّينِ ﴿35﴾";
    Na7l_26_28 = "قَدْ مَكَرَ الَّذِينَ مِنْ قَبْلِهِمْ فَأَتَى اللَّهُ بُنْيَانَهُمْ مِنَ الْقَوَاعِدِ فَخَرَّ عَلَيْهِمُ السَّقْفُ مِنْ فَوْقِهِمْ وَأَتَاهُمُ الْعَذَابُ مِنْ حَيْثُ لَا يَشْعُرُونَ ﴿26﴾ ثُمَّ يَوْمَ الْقِيَامَةِ يُخْزِيهِمْ وَيَقُولُ أَيْنَ شُرَكَائِيَ الَّذِينَ كُنْتُمْ تُشَاقُّونَ فِيهِمْ ۚ قَالَ الَّذِينَ أُوتُوا الْعِلْمَ إِنَّ الْخِزْيَ الْيَوْمَ وَالسُّوءَ عَلَى الْكَافِرِينَ ﴿27﴾ الَّذِينَ تَتَوَفَّاهُمُ الْمَلَائِكَةُ ظَالِمِي أَنْفُسِهِمْ ۖ فَأَلْقَوُا السَّلَمَ مَا كُنَّا نَعْمَلُ مِنْ سُوءٍ ۚ بَلَىٰ إِنَّ اللَّهَ عَلِيمٌ بِمَا كُنْتُمْ تَعْمَلُونَ ﴿28﴾";
    Na7l_34 = "فَأَصَابَهُمْ سَيِّئَاتُ مَا عَمِلُوا وَحَاقَ بِهِمْ مَا كَانُوا بِهِ يَسْتَهْزِئُونَ ﴿34﴾";
    Na7l_69 = "ثُمَّ كُلِي مِنْ كُلِّ الثَّمَرَاتِ فَاسْلُكِي سُبُلَ رَبِّكِ ذُلُلًا ۚ يَخْرُجُ مِنْ بُطُونِهَا شَرَابٌ مُخْتَلِفٌ أَلْوَانُهُ فِيهِ شِفَاءٌ لِلنَّاسِ ۗ إِنَّ فِي ذَٰلِكَ لَآيَةً لِقَوْمٍ يَتَفَكَّرُونَ ﴿69﴾";
    Na7l_127 = "وَاصْبِرْ وَمَا صَبْرُكَ إِلَّا بِاللَّهِ ۚ وَلَا تَحْزَنْ عَلَيْهِمْ وَلَا تَكُ فِي ضَيْقٍ مِمَّا يَمْكُرُونَ ﴿127﴾";
    Israa_45_47 = "وَإِذَا قَرَأْتَ الْقُرْآنَ جَعَلْنَا بَيْنَكَ وَبَيْنَ الَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ حِجَابًا مَسْتُورًا ﴿45﴾ وَجَعَلْنَا عَلَىٰ قُلُوبِهِمْ أَكِنَّةً أَنْ يَفْقَهُوهُ وَفِي آذَانِهِمْ وَقْرًا ۚ وَإِذَا ذَكَرْتَ رَبَّكَ فِي الْقُرْآنِ وَحْدَهُ وَلَّوْا عَلَىٰ أَدْبَارِهِمْ نُفُورًا ﴿46﴾ نَحْنُ أَعْلَمُ بِمَا يَسْتَمِعُونَ بِهِ إِذْ يَسْتَمِعُونَ إِلَيْكَ وَإِذْ هُمْ نَجْوَىٰ إِذْ يَقُولُ الظَّالِمُونَ إِنْ تَتَّبِعُونَ إِلَّا رَجُلًا مَسْحُورًا ﴿47﴾";
    Israa_65 = "إِنَّ عِبَادِي لَيْسَ لَكَ عَلَيْهِمْ سُلْطَانٌ ۚ وَكَفَىٰ بِرَبِّكَ وَكِيلًا ﴿65﴾";
    Israa_81_82 = "وَقُلْ جَاءَ الْحَقُّ وَزَهَقَ الْبَاطِلُ ۚ إِنَّ الْبَاطِلَ كَانَ زَهُوقًا ﴿81﴾ وَنُنَزِّلُ مِنَ الْقُرْآنِ مَا هُوَ شِفَاءٌ وَرَحْمَةٌ لِلْمُؤْمِنِينَ ۙ وَلَا يَزِيدُ الظَّالِمِينَ إِلَّا خَسَارًا ﴿82﴾";
    Israa_101 = "وَلَقَدْ آتَيْنَا مُوسَىٰ تِسْعَ آيَاتٍ بَيِّنَاتٍ ۖ فَاسْأَلْ بَنِي إِسْرَائِيلَ إِذْ جَاءَهُمْ فَقَالَ لَهُ فِرْعَوْنُ إِنِّي لَأَظُنُّكَ يَا مُوسَىٰ مَسْحُورًا ﴿101﴾";
    Kahf_39 = "وَلَوْلَا إِذْ دَخَلْتَ جَنَّتَكَ قُلْتَ مَا شَاءَ اللَّهُ لَا قُوَّةَ إِلَّا بِاللَّهِ ۚ إِنْ تَرَنِ أَنَا أَقَلَّ مِنْكَ مَالًا وَوَلَدًا ﴿39﴾";
    Kahf_91 = "كَذَٰلِكَ وَقَدْ أَحَطْنَا بِمَا لَدَيْهِ خُبْرًا ﴿91﴾";
    Kahf_98 = "قَالَ هَٰذَا رَحْمَةٌ مِنْ رَبِّي ۖ فَإِذَا جَاءَ وَعْدُ رَبِّي جَعَلَهُ دَكَّاءَ ۖ وَكَانَ وَعْدُ رَبِّي حَقًّا ﴿98﴾";
    Mariam_68_75 = "فَوَرَبِّكَ لَنَحْشُرَنَّهُمْ وَالشَّيَاطِينَ ثُمَّ لَنُحْضِرَنَّهُمْ حَوْلَ جَهَنَّمَ جِثِيًّا ﴿68﴾ ثُمَّ لَنَنْزِعَنَّ مِنْ كُلِّ شِيعَةٍ أَيُّهُمْ أَشَدُّ عَلَى الرَّحْمَٰنِ عِتِيًّا ﴿69﴾ ثُمَّ لَنَحْنُ أَعْلَمُ بِالَّذِينَ هُمْ أَوْلَىٰ بِهَا صِلِيًّا ﴿70﴾ وَإِنْ مِنْكُمْ إِلَّا وَارِدُهَا ۚ كَانَ عَلَىٰ رَبِّكَ حَتْمًا مَقْضِيًّا ﴿71﴾ ثُمَّ نُنَجِّي الَّذِينَ اتَّقَوْا وَنَذَرُ الظَّالِمِينَ فِيهَا جِثِيًّا ﴿72﴾ وَإِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُنَا بَيِّنَاتٍ قَالَ الَّذِينَ كَفَرُوا لِلَّذِينَ آمَنُوا أَيُّ الْفَرِيقَيْنِ خَيْرٌ مَقَامًا وَأَحْسَنُ نَدِيًّا ﴿73﴾ وَكَمْ أَهْلَكْنَا قَبْلَهُمْ مِنْ قَرْنٍ هُمْ أَحْسَنُ أَثَاثًا وَرِئْيًا ﴿74﴾ قُلْ مَنْ كَانَ فِي الضَّلَالَةِ فَلْيَمْدُدْ لَهُ الرَّحْمَٰنُ مَدًّا ۚ حَتَّىٰ إِذَا رَأَوْا مَا يُوعَدُونَ إِمَّا الْعَذَابَ وَإِمَّا السَّاعَةَ فَسَيَعْلَمُونَ مَنْ هُوَ شَرٌّ مَكَانًا وَأَضْعَفُ جُنْدًا ﴿75﴾";
    Taha_27 = "وَاحْلُلْ عُقْدَةً مِنْ لِسَانِي ﴿27﴾";
    Taha_56_70 = "وَلَقَدْ أَرَيْنَاهُ آيَاتِنَا كُلَّهَا فَكَذَّبَ وَأَبَىٰ ﴿56﴾ قَالَ أَجِئْتَنَا لِتُخْرِجَنَا مِنْ أَرْضِنَا بِسِحْرِكَ يَا مُوسَىٰ ﴿57﴾ فَلَنَأْتِيَنَّكَ بِسِحْرٍ مِثْلِهِ فَاجْعَلْ بَيْنَنَا وَبَيْنَكَ مَوْعِدًا لَا نُخْلِفُهُ نَحْنُ وَلَا أَنْتَ مَكَانًا سُوًى ﴿58﴾ قَالَ مَوْعِدُكُمْ يَوْمُ الزِّينَةِ وَأَنْ يُحْشَرَ النَّاسُ ضُحًى ﴿59﴾ فَتَوَلَّىٰ فِرْعَوْنُ فَجَمَعَ كَيْدَهُ ثُمَّ أَتَىٰ ﴿60﴾ قَالَ لَهُمْ مُوسَىٰ وَيْلَكُمْ لَا تَفْتَرُوا عَلَى اللَّهِ كَذِبًا فَيُسْحِتَكُمْ بِعَذَابٍ ۖ وَقَدْ خَابَ مَنِ افْتَرَىٰ ﴿61﴾ فَتَنَازَعُوا أَمْرَهُمْ بَيْنَهُمْ وَأَسَرُّوا النَّجْوَىٰ ﴿62﴾ قَالُوا إِنْ هَٰذَانِ لَسَاحِرَانِ يُرِيدَانِ أَنْ يُخْرِجَاكُمْ مِنْ أَرْضِكُمْ بِسِحْرِهِمَا وَيَذْهَبَا بِطَرِيقَتِكُمُ الْمُثْلَىٰ ﴿63﴾ فَأَجْمِعُوا كَيْدَكُمْ ثُمَّ ائْتُوا صَفًّا ۚ وَقَدْ أَفْلَحَ الْيَوْمَ مَنِ اسْتَعْلَىٰ ﴿64﴾ قَالُوا يَا مُوسَىٰ إِمَّا أَنْ تُلْقِيَ وَإِمَّا أَنْ نَكُونَ أَوَّلَ مَنْ أَلْقَىٰ ﴿65﴾ قَالَ بَلْ أَلْقُوا ۖ فَإِذَا حِبَالُهُمْ وَعِصِيُّهُمْ يُخَيَّلُ إِلَيْهِ مِنْ سِحْرِهِمْ أَنَّهَا تَسْعَىٰ ﴿66﴾ فَأَوْجَسَ فِي نَفْسِهِ خِيفَةً مُوسَىٰ ﴿67﴾ قُلْنَا لَا تَخَفْ إِنَّكَ أَنْتَ الْأَعْلَىٰ ﴿68﴾ وَأَلْقِ مَا فِي يَمِينِكَ تَلْقَفْ مَا صَنَعُوا ۖ إِنَّمَا صَنَعُوا كَيْدُ سَاحِرٍ ۖ وَلَا يُفْلِحُ السَّاحِرُ حَيْثُ أَتَىٰ ﴿69﴾ فَأُلْقِيَ السَّحَرَةُ سُجَّدًا قَالُوا آمَنَّا بِرَبِّ هَارُونَ وَمُوسَىٰ ﴿70﴾";
    Taha_71 = "قَالَ آمَنْتُمْ لَهُ قَبْلَ أَنْ آذَنَ لَكُمْ ۖ إِنَّهُ لَكَبِيرُكُمُ الَّذِي عَلَّمَكُمُ السِّحْرَ ۖ فَلَأُقَطِّعَنَّ أَيْدِيَكُمْ وَأَرْجُلَكُمْ مِنْ خِلَافٍ وَلَأُصَلِّبَنَّكُمْ فِي جُذُوعِ النَّخْلِ وَلَتَعْلَمُنَّ أَيُّنَا أَشَدُّ عَذَابًا وَأَبْقَىٰ ﴿71﴾";
    Taha_72_76 = "قَالُوا لَنْ نُؤْثِرَكَ عَلَىٰ مَا جَاءَنَا مِنَ الْبَيِّنَاتِ وَالَّذِي فَطَرَنَا ۖ فَاقْضِ مَا أَنْتَ قَاضٍ ۖ إِنَّمَا تَقْضِي هَٰذِهِ الْحَيَاةَ الدُّنْيَا ﴿72﴾ إِنَّا آمَنَّا بِرَبِّنَا لِيَغْفِرَ لَنَا خَطَايَانَا وَمَا أَكْرَهْتَنَا عَلَيْهِ مِنَ السِّحْرِ ۗ وَاللَّهُ خَيْرٌ وَأَبْقَىٰ ﴿73﴾ إِنَّهُ مَنْ يَأْتِ رَبَّهُ مُجْرِمًا فَإِنَّ لَهُ جَهَنَّمَ لَا يَمُوتُ فِيهَا وَلَا يَحْيَىٰ ﴿74﴾ وَمَنْ يَأْتِهِ مُؤْمِنًا قَدْ عَمِلَ الصَّالِحَاتِ فَأُولَٰئِكَ لَهُمُ الدَّرَجَاتُ الْعُلَىٰ ﴿75﴾ جَنَّاتُ عَدْنٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا ۚ وَذَٰلِكَ جَزَاءُ مَنْ تَزَكَّىٰ ﴿76﴾";
    Anbiaa_1_3 = "اقْتَرَبَ لِلنَّاسِ حِسَابُهُمْ وَهُمْ فِي غَفْلَةٍ مُعْرِضُونَ ﴿1﴾ مَا يَأْتِيهِمْ مِنْ ذِكْرٍ مِنْ رَبِّهِمْ مُحْدَثٍ إِلَّا اسْتَمَعُوهُ وَهُمْ يَلْعَبُونَ ﴿2﴾ لَاهِيَةً قُلُوبُهُمْ ۗ وَأَسَرُّوا النَّجْوَى الَّذِينَ ظَلَمُوا هَلْ هَٰذَا إِلَّا بَشَرٌ مِثْلُكُمْ ۖ أَفَتَأْتُونَ السِّحْرَ وَأَنْتُمْ تُبْصِرُونَ ﴿3﴾";
    Anbiaa_10_18 = "لَقَدْ أَنْزَلْنَا إِلَيْكُمْ كِتَابًا فِيهِ ذِكْرُكُمْ ۖ أَفَلَا تَعْقِلُونَ ﴿10﴾ وَكَمْ قَصَمْنَا مِنْ قَرْيَةٍ كَانَتْ ظَالِمَةً وَأَنْشَأْنَا بَعْدَهَا قَوْمًا آخَرِينَ ﴿11﴾ فَلَمَّا أَحَسُّوا بَأْسَنَا إِذَا هُمْ مِنْهَا يَرْكُضُونَ ﴿12﴾ لَا تَرْكُضُوا وَارْجِعُوا إِلَىٰ مَا أُتْرِفْتُمْ فِيهِ وَمَسَاكِنِكُمْ لَعَلَّكُمْ تُسْأَلُونَ ﴿13﴾ قَالُوا يَا وَيْلَنَا إِنَّا كُنَّا ظَالِمِينَ ﴿14﴾ فَمَا زَالَتْ تِلْكَ دَعْوَاهُمْ حَتَّىٰ جَعَلْنَاهُمْ حَصِيدًا خَامِدِينَ ﴿15﴾ وَمَا خَلَقْنَا السَّمَاءَ وَالْأَرْضَ وَمَا بَيْنَهُمَا لَاعِبِينَ ﴿16﴾ لَوْ أَرَدْنَا أَنْ نَتَّخِذَ لَهْوًا لَاتَّخَذْنَاهُ مِنْ لَدُنَّا إِنْ كُنَّا فَاعِلِينَ ﴿17﴾ بَلْ نَقْذِفُ بِالْحَقِّ عَلَى الْبَاطِلِ فَيَدْمَغُهُ فَإِذَا هُوَ زَاهِقٌ ۚ وَلَكُمُ الْوَيْلُ مِمَّا تَصِفُونَ ﴿18﴾";
    Anbiaa_30 = "أَوَلَمْ يَرَ الَّذِينَ كَفَرُوا أَنَّ السَّمَاوَاتِ وَالْأَرْضَ كَانَتَا رَتْقًا فَفَتَقْنَاهُمَا ۖ وَجَعَلْنَا مِنَ الْمَاءِ كُلَّ شَيْءٍ حَيٍّ ۖ أَفَلَا يُؤْمِنُونَ ﴿30﴾";
    Anbiaa_52 = "إِذْ قَالَ لِأَبِيهِ وَقَوْمِهِ مَا هَٰذِهِ التَّمَاثِيلُ الَّتِي أَنْتُمْ لَهَا عَاكِفُونَ ﴿52﴾";
    Anbiaa_70 = "وَأَرَادُوا بِهِ كَيْدًا فَجَعَلْنَاهُمُ الْأَخْسَرِينَ ﴿70﴾";
    Anbiaa_74 = "وَلُوطًا آتَيْنَاهُ حُكْمًا وَعِلْمًا وَنَجَّيْنَاهُ مِنَ الْقَرْيَةِ الَّتِي كَانَتْ تَعْمَلُ الْخَبَائِثَ ۗ إِنَّهُمْ كَانُوا قَوْمَ سَوْءٍ فَاسِقِينَ ﴿74﴾";
    Anbiaa_82 = "وَمِنَ الشَّيَاطِينِ مَنْ يَغُوصُونَ لَهُ وَيَعْمَلُونَ عَمَلًا دُونَ ذَٰلِكَ ۖ وَكُنَّا لَهُمْ حَافِظِينَ ﴿82﴾";
    Anbiaa_83_84 = "وَأَيُّوبَ إِذْ نَادَىٰ رَبَّهُ أَنِّي مَسَّنِيَ الضُّرُّ وَأَنْتَ أَرْحَمُ الرَّاحِمِينَ ﴿83﴾ فَاسْتَجَبْنَا لَهُ فَكَشَفْنَا مَا بِهِ مِنْ ضُرٍّ ۖ وَآتَيْنَاهُ أَهْلَهُ وَمِثْلَهُمْ مَعَهُمْ رَحْمَةً مِنْ عِنْدِنَا وَذِكْرَىٰ لِلْعَابِدِينَ ﴿84﴾";
    Hej_19_22 = "هَٰذَانِ خَصْمَانِ اخْتَصَمُوا فِي رَبِّهِمْ ۖ فَالَّذِينَ كَفَرُوا قُطِّعَتْ لَهُمْ ثِيَابٌ مِنْ نَارٍ يُصَبُّ مِنْ فَوْقِ رُءُوسِهِمُ الْحَمِيمُ ﴿19﴾ يُصْهَرُ بِهِ مَا فِي بُطُونِهِمْ وَالْجُلُودُ ﴿20﴾ وَلَهُمْ مَقَامِعُ مِنْ حَدِيدٍ ﴿21﴾ كُلَّمَا أَرَادُوا أَنْ يَخْرُجُوا مِنْهَا مِنْ غَمٍّ أُعِيدُوا فِيهَا وَذُوقُوا عَذَابَ الْحَرِيقِ ﴿22﴾";
    Hej_62 = "ذَٰلِكَ بِأَنَّ اللَّهَ هُوَ الْحَقُّ وَأَنَّ مَا يَدْعُونَ مِنْ دُونِهِ هُوَ الْبَاطِلُ وَأَنَّ اللَّهَ هُوَ الْعَلِيُّ الْكَبِيرُ ﴿62﴾";
    Moamenoun_63 = "بَلْ قُلُوبُهُمْ فِي غَمْرَةٍ مِنْ هَٰذَا وَلَهُمْ أَعْمَالٌ مِنْ دُونِ ذَٰلِكَ هُمْ لَهَا عَامِلُونَ ﴿63﴾";
    Moamenoun_88_89 = "قُلْ مَنْ بِيَدِهِ مَلَكُوتُ كُلِّ شَيْءٍ وَهُوَ يُجِيرُ وَلَا يُجَارُ عَلَيْهِ إِنْ كُنْتُمْ تَعْلَمُونَ ﴿88﴾ سَيَقُولُونَ لِلَّهِ ۚ قُلْ فَأَنَّىٰ تُسْحَرُونَ ﴿89﴾";
    Moamenoun_97_108 = "وَقُلْ رَبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ ﴿97﴾ وَأَعُوذُ بِكَ رَبِّ أَنْ يَحْضُرُونِ ﴿98﴾ حَتَّىٰ إِذَا جَاءَ أَحَدَهُمُ الْمَوْتُ قَالَ رَبِّ ارْجِعُونِ ﴿99﴾ لَعَلِّي أَعْمَلُ صَالِحًا فِيمَا تَرَكْتُ ۚ كَلَّا ۚ إِنَّهَا كَلِمَةٌ هُوَ قَائِلُهَا ۖ وَمِنْ وَرَائِهِمْ بَرْزَخٌ إِلَىٰ يَوْمِ يُبْعَثُونَ ﴿100﴾ فَإِذَا نُفِخَ فِي الصُّورِ فَلَا أَنْسَابَ بَيْنَهُمْ يَوْمَئِذٍ وَلَا يَتَسَاءَلُونَ ﴿101﴾ فَمَنْ ثَقُلَتْ مَوَازِينُهُ فَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ ﴿102﴾ وَمَنْ خَفَّتْ مَوَازِينُهُ فَأُولَٰئِكَ الَّذِينَ خَسِرُوا أَنْفُسَهُمْ فِي جَهَنَّمَ خَالِدُونَ ﴿103﴾ تَلْفَحُ وُجُوهَهُمُ النَّارُ وَهُمْ فِيهَا كَالِحُونَ ﴿104﴾ أَلَمْ تَكُنْ آيَاتِي تُتْلَىٰ عَلَيْكُمْ فَكُنْتُمْ بِهَا تُكَذِّبُونَ ﴿105﴾ قَالُوا رَبَّنَا غَلَبَتْ عَلَيْنَا شِقْوَتُنَا وَكُنَّا قَوْمًا ضَالِّينَ ﴿106﴾ رَبَّنَا أَخْرِجْنَا مِنْهَا فَإِنْ عُدْنَا فَإِنَّا ظَالِمُونَ ﴿107﴾ قَالَ اخْسَئُوا فِيهَا وَلَا تُكَلِّمُونِ ﴿108﴾";
    Moamenoun_115_118End = "أَفَحَسِبْتُمْ أَنَّمَا خَلَقْنَاكُمْ عَبَثًا وَأَنَّكُمْ إِلَيْنَا لَا تُرْجَعُونَ ﴿115﴾ فَتَعَالَى اللَّهُ الْمَلِكُ الْحَقُّ ۖ لَا إِلَٰهَ إِلَّا هُوَ رَبُّ الْعَرْشِ الْكَرِيمِ ﴿116﴾ وَمَنْ يَدْعُ مَعَ اللَّهِ إِلَٰهًا آخَرَ لَا بُرْهَانَ لَهُ بِهِ فَإِنَّمَا حِسَابُهُ عِنْدَ رَبِّهِ ۚ إِنَّهُ لَا يُفْلِحُ الْكَافِرُونَ ﴿117﴾ وَقُلْ رَبِّ اغْفِرْ وَارْحَمْ وَأَنْتَ خَيْرُ الرَّاحِمِينَ ﴿118﴾";
    Nour_24 = "يَوْمَ تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وَأَيْدِيهِمْ وَأَرْجُلُهُمْ بِمَا كَانُوا يَعْمَلُونَ ﴿24﴾";
    Nour_31 = "وَقُلْ لِلْمُؤْمِنَاتِ يَغْضُضْنَ مِنْ أَبْصَارِهِنَّ وَيَحْفَظْنَ فُرُوجَهُنَّ وَلَا يُبْدِينَ زِينَتَهُنَّ إِلَّا مَا ظَهَرَ مِنْهَا ۖ وَلْيَضْرِبْنَ بِخُمُرِهِنَّ عَلَىٰ جُيُوبِهِنَّ ۖ وَلَا يُبْدِينَ زِينَتَهُنَّ إِلَّا لِبُعُولَتِهِنَّ أَوْ آبَائِهِنَّ أَوْ آبَاءِ بُعُولَتِهِنَّ أَوْ أَبْنَائِهِنَّ أَوْ أَبْنَاءِ بُعُولَتِهِنَّ أَوْ إِخْوَانِهِنَّ أَوْ بَنِي إِخْوَانِهِنَّ أَوْ بَنِي أَخَوَاتِهِنَّ أَوْ نِسَائِهِنَّ أَوْ مَا مَلَكَتْ أَيْمَانُهُنَّ أَوِ التَّابِعِينَ غَيْرِ أُولِي الْإِرْبَةِ مِنَ الرِّجَالِ أَوِ الطِّفْلِ الَّذِينَ لَمْ يَظْهَرُوا عَلَىٰ عَوْرَاتِ النِّسَاءِ ۖ وَلَا يَضْرِبْنَ بِأَرْجُلِهِنَّ لِيُعْلَمَ مَا يُخْفِينَ مِنْ زِينَتِهِنَّ ۚ وَتُوبُوا إِلَى اللَّهِ جَمِيعًا أَيُّهَ الْمُؤْمِنُونَ لَعَلَّكُمْ تُفْلِحُونَ ﴿31﴾";
    Nour_35 = "اللَّهُ نُورُ السَّمَاوَاتِ وَالْأَرْضِ ۚ مَثَلُ نُورِهِ كَمِشْكَاةٍ فِيهَا مِصْبَاحٌ ۖ الْمِصْبَاحُ فِي زُجَاجَةٍ ۖ الزُّجَاجَةُ كَأَنَّهَا كَوْكَبٌ دُرِّيٌّ يُوقَدُ مِنْ شَجَرَةٍ مُبَارَكَةٍ زَيْتُونَةٍ لَا شَرْقِيَّةٍ وَلَا غَرْبِيَّةٍ يَكَادُ زَيْتُهَا يُضِيءُ وَلَوْ لَمْ تَمْسَسْهُ نَارٌ ۚ نُورٌ عَلَىٰ نُورٍ ۗ يَهْدِي اللَّهُ لِنُورِهِ مَنْ يَشَاءُ ۚ وَيَضْرِبُ اللَّهُ الْأَمْثَالَ لِلنَّاسِ ۗ وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ ﴿35﴾";
    Nour_39 = "وَالَّذِينَ كَفَرُوا أَعْمَالُهُمْ كَسَرَابٍ بِقِيعَةٍ يَحْسَبُهُ الظَّمْآنُ مَاءً حَتَّىٰ إِذَا جَاءَهُ لَمْ يَجِدْهُ شَيْئًا وَوَجَدَ اللَّهَ عِنْدَهُ فَوَفَّاهُ حِسَابَهُ ۗ وَاللَّهُ سَرِيعُ الْحِسَابِ ﴿39﴾";
    Nour_45 = "وَاللَّهُ خَلَقَ كُلَّ دَابَّةٍ مِنْ مَاءٍ ۖ فَمِنْهُمْ مَنْ يَمْشِي عَلَىٰ بَطْنِهِ وَمِنْهُمْ مَنْ يَمْشِي عَلَىٰ رِجْلَيْنِ وَمِنْهُمْ مَنْ يَمْشِي عَلَىٰ أَرْبَعٍ ۚ يَخْلُقُ اللَّهُ مَا يَشَاءُ ۚ إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ ﴿45﴾";
    Forquan_7_8 = "وَقَالُوا مَالِ هَٰذَا الرَّسُولِ يَأْكُلُ الطَّعَامَ وَيَمْشِي فِي الْأَسْوَاقِ ۙ لَوْلَا أُنْزِلَ إِلَيْهِ مَلَكٌ فَيَكُونَ مَعَهُ نَذِيرًا ﴿7﴾ أَوْ يُلْقَىٰ إِلَيْهِ كَنْزٌ أَوْ تَكُونُ لَهُ جَنَّةٌ يَأْكُلُ مِنْهَا ۚ وَقَالَ الظَّالِمُونَ إِنْ تَتَّبِعُونَ إِلَّا رَجُلًا مَسْحُورًا ﴿8﴾";
    Forquan_21_23 = "وَقَالَ الَّذِينَ لَا يَرْجُونَ لِقَاءَنَا لَوْلَا أُنْزِلَ عَلَيْنَا الْمَلَائِكَةُ أَوْ نَرَىٰ رَبَّنَا ۗ لَقَدِ اسْتَكْبَرُوا فِي أَنْفُسِهِمْ وَعَتَوْا عُتُوًّا كَبِيرًا ﴿21﴾ يَوْمَ يَرَوْنَ الْمَلَائِكَةَ لَا بُشْرَىٰ يَوْمَئِذٍ لِلْمُجْرِمِينَ وَيَقُولُونَ حِجْرًا مَحْجُورًا ﴿22﴾ وَقَدِمْنَا إِلَىٰ مَا عَمِلُوا مِنْ عَمَلٍ فَجَعَلْنَاهُ هَبَاءً مَنْثُورًا ﴿23﴾";
    Shouaraa_34_42 = "قَالَ لِلْمَلَإِ حَوْلَهُ إِنَّ هَٰذَا لَسَاحِرٌ عَلِيمٌ ﴿34﴾ يُرِيدُ أَنْ يُخْرِجَكُمْ مِنْ أَرْضِكُمْ بِسِحْرِهِ فَمَاذَا تَأْمُرُونَ ﴿35﴾ قَالُوا أَرْجِهْ وَأَخَاهُ وَابْعَثْ فِي الْمَدَائِنِ حَاشِرِينَ ﴿36﴾ يَأْتُوكَ بِكُلِّ سَحَّارٍ عَلِيمٍ ﴿37﴾ فَجُمِعَ السَّحَرَةُ لِمِيقَاتِ يَوْمٍ مَعْلُومٍ ﴿38﴾ وَقِيلَ لِلنَّاسِ هَلْ أَنْتُمْ مُجْتَمِعُونَ ﴿39﴾ لَعَلَّنَا نَتَّبِعُ السَّحَرَةَ إِنْ كَانُوا هُمُ الْغَالِبِينَ ﴿40﴾ فَلَمَّا جَاءَ السَّحَرَةُ قَالُوا لِفِرْعَوْنَ أَئِنَّ لَنَا لَأَجْرًا إِنْ كُنَّا نَحْنُ الْغَالِبِينَ ﴿41﴾ قَالَ نَعَمْ وَإِنَّكُمْ إِذًا لَمِنَ الْمُقَرَّبِينَ ﴿42﴾";
    Shouaraa_43_48 = "قَالَ لَهُمْ مُوسَىٰ أَلْقُوا مَا أَنْتُمْ مُلْقُونَ ﴿43﴾ فَأَلْقَوْا حِبَالَهُمْ وَعِصِيَّهُمْ وَقَالُوا بِعِزَّةِ فِرْعَوْنَ إِنَّا لَنَحْنُ الْغَالِبُونَ ﴿44﴾ فَأَلْقَىٰ مُوسَىٰ عَصَاهُ فَإِذَا هِيَ تَلْقَفُ مَا يَأْفِكُونَ ﴿45﴾ فَأُلْقِيَ السَّحَرَةُ سَاجِدِينَ ﴿46﴾ قَالُوا آمَنَّا بِرَبِّ الْعَالَمِينَ ﴿47﴾ رَبِّ مُوسَىٰ وَهَارُونَ ﴿48﴾";
    Shouaraa_49_51 = "قَالَ آمَنْتُمْ لَهُ قَبْلَ أَنْ آذَنَ لَكُمْ ۖ إِنَّهُ لَكَبِيرُكُمُ الَّذِي عَلَّمَكُمُ السِّحْرَ فَلَسَوْفَ تَعْلَمُونَ ۚ لَأُقَطِّعَنَّ أَيْدِيَكُمْ وَأَرْجُلَكُمْ مِنْ خِلَافٍ وَلَأُصَلِّبَنَّكُمْ أَجْمَعِينَ ﴿49﴾ قَالُوا لَا ضَيْرَ ۖ إِنَّا إِلَىٰ رَبِّنَا مُنْقَلِبُونَ ﴿50﴾ إِنَّا نَطْمَعُ أَنْ يَغْفِرَ لَنَا رَبُّنَا خَطَايَانَا أَنْ كُنَّا أَوَّلَ الْمُؤْمِنِينَ ﴿51﴾";
    Shouaraa_75_85 = "قَالَ أَفَرَأَيْتُمْ مَا كُنْتُمْ تَعْبُدُونَ ﴿75﴾ أَنْتُمْ وَآبَاؤُكُمُ الْأَقْدَمُونَ ﴿76﴾ فَإِنَّهُمْ عَدُوٌّ لِي إِلَّا رَبَّ الْعَالَمِينَ ﴿77﴾ الَّذِي خَلَقَنِي فَهُوَ يَهْدِينِ ﴿78﴾ وَالَّذِي هُوَ يُطْعِمُنِي وَيَسْقِينِ ﴿79﴾ وَإِذَا مَرِضْتُ فَهُوَ يَشْفِينِ ﴿80﴾ وَالَّذِي يُمِيتُنِي ثُمَّ يُحْيِينِ ﴿81﴾ وَالَّذِي أَطْمَعُ أَنْ يَغْفِرَ لِي خَطِيئَتِي يَوْمَ الدِّينِ ﴿82﴾ رَبِّ هَبْ لِي حُكْمًا وَأَلْحِقْنِي بِالصَّالِحِينَ ﴿83﴾ وَاجْعَلْ لِي لِسَانَ صِدْقٍ فِي الْآخِرِينَ ﴿84﴾ وَاجْعَلْنِي مِنْ وَرَثَةِ جَنَّةِ النَّعِيمِ ﴿85﴾";
    Shouaraa_153 = "قَالُوا إِنَّمَا أَنْتَ مِنَ الْمُسَحَّرِينَ ﴿153﴾";
    Shouaraa_168_170 = "قَالَ إِنِّي لِعَمَلِكُمْ مِنَ الْقَالِينَ ﴿168﴾ رَبِّ نَجِّنِي وَأَهْلِي مِمَّا يَعْمَلُونَ ﴿169﴾ فَنَجَّيْنَاهُ وَأَهْلَهُ أَجْمَعِينَ ﴿170﴾";
    Naml_13 = "فَلَمَّا جَاءَتْهُمْ آيَاتُنَا مُبْصِرَةً قَالُوا هَٰذَا سِحْرٌ مُبِينٌ ﴿13﴾";
    Naml_22 = "فَمَكَثَ غَيْرَ بَعِيدٍ فَقَالَ أَحَطْتُ بِمَا لَمْ تُحِطْ بِهِ وَجِئْتُكَ مِنْ سَبَإٍ بِنَبَإٍ يَقِينٍ ﴿22﴾";
    Naml_30_31 = "إِنَّهُ مِنْ سُلَيْمَانَ وَإِنَّهُ بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ ﴿30﴾ أَلَّا تَعْلُوا عَلَيَّ وَأْتُونِي مُسْلِمِينَ ﴿31﴾";
    Naml_50_51 = "وَمَكَرُوا مَكْرًا وَمَكَرْنَا مَكْرًا وَهُمْ لَا يَشْعُرُونَ ﴿50﴾ فَانْظُرْ كَيْفَ كَانَ عَاقِبَةُ مَكْرِهِمْ أَنَّا دَمَّرْنَاهُمْ وَقَوْمَهُمْ أَجْمَعِينَ ﴿51﴾";
    Naml_62 = "أَمَّنْ يُجِيبُ الْمُضْطَرَّ إِذَا دَعَاهُ وَيَكْشِفُ السُّوءَ وَيَجْعَلُكُمْ خُلَفَاءَ الْأَرْضِ ۗ أَإِلَٰهٌ مَعَ اللَّهِ ۚ قَلِيلًا مَا تَذَكَّرُونَ ﴿62﴾";
    Kasas_36 = "فَلَمَّا جَاءَهُمْ مُوسَىٰ بِآيَاتِنَا بَيِّنَاتٍ قَالُوا مَا هَٰذَا إِلَّا سِحْرٌ مُفْتَرًى وَمَا سَمِعْنَا بِهَٰذَا فِي آبَائِنَا الْأَوَّلِينَ ﴿36﴾";
    Kasas_48 = "فَلَمَّا جَاءَهُمُ الْحَقُّ مِنْ عِنْدِنَا قَالُوا لَوْلَا أُوتِيَ مِثْلَ مَا أُوتِيَ مُوسَىٰ ۚ أَوَلَمْ يَكْفُرُوا بِمَا أُوتِيَ مُوسَىٰ مِنْ قَبْلُ ۖ قَالُوا سِحْرَانِ تَظَاهَرَا وَقَالُوا إِنَّا بِكُلٍّ كَافِرُونَ ﴿48﴾";
    Al3ankapoot_4 = "أَمْ حَسِبَ الَّذِينَ يَعْمَلُونَ السَّيِّئَاتِ أَنْ يَسْبِقُونَا ۚ سَاءَ مَا يَحْكُمُونَ ﴿4﴾";
    Al3ankapoot_55 = "يَوْمَ يَغْشَاهُمُ الْعَذَابُ مِنْ فَوْقِهِمْ وَمِنْ تَحْتِ أَرْجُلِهِمْ وَيَقُولُ ذُوقُوا مَا كُنْتُمْ تَعْمَلُونَ ﴿55﴾";
    Room_21 = "وَمِنْ آيَاتِهِ أَنْ خَلَقَ لَكُمْ مِنْ أَنْفُسِكُمْ أَزْوَاجًا لِتَسْكُنُوا إِلَيْهَا وَجَعَلَ بَيْنَكُمْ مَوَدَّةً وَرَحْمَةً ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يَتَفَكَّرُونَ ﴿21﴾";
    Room_30 = "فَأَقِمْ وَجْهَكَ لِلدِّينِ حَنِيفًا ۚ فِطْرَتَ اللَّهِ الَّتِي فَطَرَ النَّاسَ عَلَيْهَا ۚ لَا تَبْدِيلَ لِخَلْقِ اللَّهِ ۚ ذَٰلِكَ الدِّينُ الْقَيِّمُ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ ﴿30﴾";
    Lokman_16 = "يَا بُنَيَّ إِنَّهَا إِنْ تَكُ مِثْقَالَ حَبَّةٍ مِنْ خَرْدَلٍ فَتَكُنْ فِي صَخْرَةٍ أَوْ فِي السَّمَاوَاتِ أَوْ فِي الْأَرْضِ يَأْتِ بِهَا اللَّهُ ۚ إِنَّ اللَّهَ لَطِيفٌ خَبِيرٌ ﴿16﴾";
    A7zab_3 = "وَتَوَكَّلْ عَلَى اللَّهِ ۚ وَكَفَىٰ بِاللَّهِ وَكِيلًا ﴿3﴾";
    A7zab_19 = "أَشِحَّةً عَلَيْكُمْ ۖ فَإِذَا جَاءَ الْخَوْفُ رَأَيْتَهُمْ يَنْظُرُونَ إِلَيْكَ تَدُورُ أَعْيُنُهُمْ كَالَّذِي يُغْشَىٰ عَلَيْهِ مِنَ الْمَوْتِ ۖ فَإِذَا ذَهَبَ الْخَوْفُ سَلَقُوكُمْ بِأَلْسِنَةٍ حِدَادٍ أَشِحَّةً عَلَى الْخَيْرِ ۚ أُولَٰئِكَ لَمْ يُؤْمِنُوا فَأَحْبَطَ اللَّهُ أَعْمَالَهُمْ ۚ وَكَانَ ذَٰلِكَ عَلَى اللَّهِ يَسِيرًا ﴿19﴾";
    A7zab_39 = "الَّذِينَ يُبَلِّغُونَ رِسَالَاتِ اللَّهِ وَيَخْشَوْنَهُ وَلَا يَخْشَوْنَ أَحَدًا إِلَّا اللَّهَ ۗ وَكَفَىٰ بِاللَّهِ حَسِيبًا ﴿39﴾";
    Sabaa_12 = "وَلِسُلَيْمَانَ الرِّيحَ غُدُوُّهَا شَهْرٌ وَرَوَاحُهَا شَهْرٌ ۖ وَأَسَلْنَا لَهُ عَيْنَ الْقِطْرِ ۖ وَمِنَ الْجِنِّ مَنْ يَعْمَلُ بَيْنَ يَدَيْهِ بِإِذْنِ رَبِّهِ ۖ وَمَنْ يَزِغْ مِنْهُمْ عَنْ أَمْرِنَا نُذِقْهُ مِنْ عَذَابِ السَّعِيرِ ﴿12﴾";
    Sabaa_13 = "يَعْمَلُونَ لَهُ مَا يَشَاءُ مِنْ مَحَارِيبَ وَتَمَاثِيلَ وَجِفَانٍ كَالْجَوَابِ وَقُدُورٍ رَاسِيَاتٍ ۚ اعْمَلُوا آلَ دَاوُودَ شُكْرًا ۚ وَقَلِيلٌ مِنْ عِبَادِيَ الشَّكُورُ ﴿13﴾";
    Sabaa_21 = "وَمَا كَانَ لَهُ عَلَيْهِمْ مِنْ سُلْطَانٍ إِلَّا لِنَعْلَمَ مَنْ يُؤْمِنُ بِالْآخِرَةِ مِمَّنْ هُوَ مِنْهَا فِي شَكٍّ ۗ وَرَبُّكَ عَلَىٰ كُلِّ شَيْءٍ حَفِيظٌ ﴿21﴾";
    Sabaa_48_49 = "قُلْ إِنَّ رَبِّي يَقْذِفُ بِالْحَقِّ عَلَّامُ الْغُيُوبِ ﴿48﴾ قُلْ جَاءَ الْحَقُّ وَمَا يُبْدِئُ الْبَاطِلُ وَمَا يُعِيدُ ﴿49﴾";
    Fater_2 = "مَا يَفْتَحِ اللَّهُ لِلنَّاسِ مِنْ رَحْمَةٍ فَلَا مُمْسِكَ لَهَا ۖ وَمَا يُمْسِكْ فَلَا مُرْسِلَ لَهُ مِنْ بَعْدِهِ ۚ وَهُوَ الْعَزِيزُ الْحَكِيمُ ﴿2﴾";
    Fater_43 = "اسْتِكْبَارًا فِي الْأَرْضِ وَمَكْرَ السَّيِّئِ ۚ وَلَا يَحِيقُ الْمَكْرُ السَّيِّئُ إِلَّا بِأَهْلِهِ ۚ فَهَلْ يَنْظُرُونَ إِلَّا سُنَّتَ الْأَوَّلِينَ ۚ فَلَنْ تَجِدَ لِسُنَّتِ اللَّهِ تَبْدِيلًا ۖ وَلَنْ تَجِدَ لِسُنَّتِ اللَّهِ تَحْوِيلًا ﴿43﴾";
    Yaseen_1_12 = "يس ﴿1﴾ وَالْقُرْآنِ الْحَكِيمِ ﴿2﴾ إِنَّكَ لَمِنَ الْمُرْسَلِينَ ﴿3﴾ عَلَىٰ صِرَاطٍ مُسْتَقِيمٍ ﴿4﴾ تَنْزِيلَ الْعَزِيزِ الرَّحِيمِ ﴿5﴾ لِتُنْذِرَ قَوْمًا مَا أُنْذِرَ آبَاؤُهُمْ فَهُمْ غَافِلُونَ ﴿6﴾ لَقَدْ حَقَّ الْقَوْلُ عَلَىٰ أَكْثَرِهِمْ فَهُمْ لَا يُؤْمِنُونَ ﴿7﴾ إِنَّا جَعَلْنَا فِي أَعْنَاقِهِمْ أَغْلَالًا فَهِيَ إِلَى الْأَذْقَانِ فَهُمْ مُقْمَحُونَ ﴿8﴾ وَجَعَلْنَا مِنْ بَيْنِ أَيْدِيهِمْ سَدًّا وَمِنْ خَلْفِهِمْ سَدًّا فَأَغْشَيْنَاهُمْ فَهُمْ لَا يُبْصِرُونَ ﴿9﴾ وَسَوَاءٌ عَلَيْهِمْ أَأَنْذَرْتَهُمْ أَمْ لَمْ تُنْذِرْهُمْ لَا يُؤْمِنُونَ ﴿10﴾ إِنَّمَا تُنْذِرُ مَنِ اتَّبَعَ الذِّكْرَ وَخَشِيَ الرَّحْمَٰنَ بِالْغَيْبِ ۖ فَبَشِّرْهُ بِمَغْفِرَةٍ وَأَجْرٍ كَرِيمٍ ﴿11﴾ إِنَّا نَحْنُ نُحْيِي الْمَوْتَىٰ وَنَكْتُبُ مَا قَدَّمُوا وَآثَارَهُمْ ۚ وَكُلَّ شَيْءٍ أَحْصَيْنَاهُ فِي إِمَامٍ مُبِينٍ ﴿12﴾";
    Yaseen_49_53 = "مَا يَنْظُرُونَ إِلَّا صَيْحَةً وَاحِدَةً تَأْخُذُهُمْ وَهُمْ يَخِصِّمُونَ ﴿49﴾ فَلَا يَسْتَطِيعُونَ تَوْصِيَةً وَلَا إِلَىٰ أَهْلِهِمْ يَرْجِعُونَ ﴿50﴾ وَنُفِخَ فِي الصُّورِ فَإِذَا هُمْ مِنَ الْأَجْدَاثِ إِلَىٰ رَبِّهِمْ يَنْسِلُونَ ﴿51﴾ قَالُوا يَا وَيْلَنَا مَنْ بَعَثَنَا مِنْ مَرْقَدِنَا ۜ ۗ هَٰذَا مَا وَعَدَ الرَّحْمَٰنُ وَصَدَقَ الْمُرْسَلُونَ ﴿52﴾ إِنْ كَانَتْ إِلَّا صَيْحَةً وَاحِدَةً فَإِذَا هُمْ جَمِيعٌ لَدَيْنَا مُحْضَرُونَ ﴿53﴾";
    Yaseen_65 = "الْيَوْمَ نَخْتِمُ عَلَىٰ أَفْوَاهِهِمْ وَتُكَلِّمُنَا أَيْدِيهِمْ وَتَشْهَدُ أَرْجُلُهُمْ بِمَا كَانُوا يَكْسِبُونَ ﴿65﴾";
    Saffat_1_10 = "وَالصَّافَّاتِ صَفًّا ﴿1﴾ فَالزَّاجِرَاتِ زَجْرًا ﴿2﴾ فَالتَّالِيَاتِ ذِكْرًا ﴿3﴾ إِنَّ إِلَٰهَكُمْ لَوَاحِدٌ ﴿4﴾ رَبُّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا وَرَبُّ الْمَشَارِقِ ﴿5﴾ إِنَّا زَيَّنَّا السَّمَاءَ الدُّنْيَا بِزِينَةٍ الْكَوَاكِبِ ﴿6﴾ وَحِفْظًا مِنْ كُلِّ شَيْطَانٍ مَارِدٍ ﴿7﴾ لَا يَسَّمَّعُونَ إِلَى الْمَلَإِ الْأَعْلَىٰ وَيُقْذَفُونَ مِنْ كُلِّ جَانِبٍ ﴿8﴾ دُحُورًا ۖ وَلَهُمْ عَذَابٌ وَاصِبٌ ﴿9﴾ إِلَّا مَنْ خَطِفَ الْخَطْفَةَ فَأَتْبَعَهُ شِهَابٌ ثَاقِبٌ ﴿10﴾";
    Saffat_62_73 = "أَذَٰلِكَ خَيْرٌ نُزُلًا أَمْ شَجَرَةُ الزَّقُّومِ ﴿62﴾ إِنَّا جَعَلْنَاهَا فِتْنَةً لِلظَّالِمِينَ ﴿63﴾ إِنَّهَا شَجَرَةٌ تَخْرُجُ فِي أَصْلِ الْجَحِيمِ ﴿64﴾ طَلْعُهَا كَأَنَّهُ رُءُوسُ الشَّيَاطِينِ ﴿65﴾ فَإِنَّهُمْ لَآكِلُونَ مِنْهَا فَمَالِئُونَ مِنْهَا الْبُطُونَ ﴿66﴾ ثُمَّ إِنَّ لَهُمْ عَلَيْهَا لَشَوْبًا مِنْ حَمِيمٍ ﴿67﴾ ثُمَّ إِنَّ مَرْجِعَهُمْ لَإِلَى الْجَحِيمِ ﴿68﴾ إِنَّهُمْ أَلْفَوْا آبَاءَهُمْ ضَالِّينَ ﴿69﴾ فَهُمْ عَلَىٰ آثَارِهِمْ يُهْرَعُونَ ﴿70﴾ وَلَقَدْ ضَلَّ قَبْلَهُمْ أَكْثَرُ الْأَوَّلِينَ ﴿71﴾ وَلَقَدْ أَرْسَلْنَا فِيهِمْ مُنْذِرِينَ ﴿72﴾ فَانْظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُنْذَرِينَ ﴿73﴾";
    Saffat_98 = "فَأَرَادُوا بِهِ كَيْدًا فَجَعَلْنَاهُمُ الْأَسْفَلِينَ ﴿98﴾";
    Saffat_143_144 = "فَلَوْلَا أَنَّهُ كَانَ مِنَ الْمُسَبِّحِينَ ﴿143﴾ لَلَبِثَ فِي بَطْنِهِ إِلَىٰ يَوْمِ يُبْعَثُونَ ﴿144﴾";
    Saffat_158_159 = "وَجَعَلُوا بَيْنَهُ وَبَيْنَ الْجِنَّةِ نَسَبًا ۚ وَلَقَدْ عَلِمَتِ الْجِنَّةُ إِنَّهُمْ لَمُحْضَرُونَ ﴿158﴾ سُبْحَانَ اللَّهِ عَمَّا يَصِفُونَ ﴿159﴾";
    SaDD_1_4 = "ص ۚ وَالْقُرْآنِ ذِي الذِّكْرِ ﴿1﴾ بَلِ الَّذِينَ كَفَرُوا فِي عِزَّةٍ وَشِقَاقٍ ﴿2﴾ كَمْ أَهْلَكْنَا مِنْ قَبْلِهِمْ مِنْ قَرْنٍ فَنَادَوْا وَلَاتَ حِينَ مَنَاصٍ ﴿3﴾ وَعَجِبُوا أَنْ جَاءَهُمْ مُنْذِرٌ مِنْهُمْ ۖ وَقَالَ الْكَافِرُونَ هَٰذَا سَاحِرٌ كَذَّابٌ ﴿4﴾";
    SaDD_42 = "ارْكُضْ بِرِجْلِكَ ۖ هَٰذَا مُغْتَسَلٌ بَارِدٌ وَشَرَابٌ ﴿42﴾";
    Zomar_36 = "أَلَيْسَ اللَّهُ بِكَافٍ عَبْدَهُ ۖ وَيُخَوِّفُونَكَ بِالَّذِينَ مِنْ دُونِهِ ۚ وَمَنْ يُضْلِلِ اللَّهُ فَمَا لَهُ مِنْ هَادٍ ﴿36﴾";
    Zomar_38 = "وَلَئِنْ سَأَلْتَهُمْ مَنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ لَيَقُولُنَّ اللَّهُ ۚ قُلْ أَفَرَأَيْتُمْ مَا تَدْعُونَ مِنْ دُونِ اللَّهِ إِنْ أَرَادَنِيَ اللَّهُ بِضُرٍّ هَلْ هُنَّ كَاشِفَاتُ ضُرِّهِ أَوْ أَرَادَنِي بِرَحْمَةٍ هَلْ هُنَّ مُمْسِكَاتُ رَحْمَتِهِ ۚ قُلْ حَسْبِيَ اللَّهُ ۖ عَلَيْهِ يَتَوَكَّلُ الْمُتَوَكِّلُونَ ﴿38﴾";
    Zomar_62 = "اللَّهُ خَالِقُ كُلِّ شَيْءٍ ۖ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ وَكِيلٌ ﴿62﴾";
    Ghafer_23_24 = "وَلَقَدْ أَرْسَلْنَا مُوسَىٰ بِآيَاتِنَا وَسُلْطَانٍ مُبِينٍ ﴿23﴾ إِلَىٰ فِرْعَوْنَ وَهَامَانَ وَقَارُونَ فَقَالُوا سَاحِرٌ كَذَّابٌ ﴿24﴾";
    Ghafer_45 = "فَوَقَاهُ اللَّهُ سَيِّئَاتِ مَا مَكَرُوا ۖ وَحَاقَ بِآلِ فِرْعَوْنَ سُوءُ الْعَذَابِ ﴿45﴾";
    Ghafer_78 = "وَلَقَدْ أَرْسَلْنَا رُسُلًا مِنْ قَبْلِكَ مِنْهُمْ مَنْ قَصَصْنَا عَلَيْكَ وَمِنْهُمْ مَنْ لَمْ نَقْصُصْ عَلَيْكَ ۗ وَمَا كَانَ لِرَسُولٍ أَنْ يَأْتِيَ بِآيَةٍ إِلَّا بِإِذْنِ اللَّهِ ۚ فَإِذَا جَاءَ أَمْرُ اللَّهِ قُضِيَ بِالْحَقِّ وَخَسِرَ هُنَالِكَ الْمُبْطِلُونَ ﴿78﴾";
    Fussilat_12 = "فَقَضَاهُنَّ سَبْعَ سَمَاوَاتٍ فِي يَوْمَيْنِ وَأَوْحَىٰ فِي كُلِّ سَمَاءٍ أَمْرَهَا ۚ وَزَيَّنَّا السَّمَاءَ الدُّنْيَا بِمَصَابِيحَ وَحِفْظًا ۚ ذَٰلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ ﴿12﴾";
    Fussilat_54End = "أَلَا إِنَّهُمْ فِي مِرْيَةٍ مِنْ لِقَاءِ رَبِّهِمْ ۗ أَلَا إِنَّهُ بِكُلِّ شَيْءٍ مُحِيطٌ ﴿54﴾";
    Shora_6 = "وَالَّذِينَ اتَّخَذُوا مِنْ دُونِهِ أَوْلِيَاءَ اللَّهُ حَفِيظٌ عَلَيْهِمْ وَمَا أَنْتَ عَلَيْهِمْ بِوَكِيلٍ ﴿6﴾";
    Shora_24 = "أَمْ يَقُولُونَ افْتَرَىٰ عَلَى اللَّهِ كَذِبًا ۖ فَإِنْ يَشَإِ اللَّهُ يَخْتِمْ عَلَىٰ قَلْبِكَ ۗ وَيَمْحُ اللَّهُ الْبَاطِلَ وَيُحِقُّ الْحَقَّ بِكَلِمَاتِهِ ۚ إِنَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ ﴿24﴾";
    Zokhrof_30 = "وَلَمَّا جَاءَهُمُ الْحَقُّ قَالُوا هَٰذَا سِحْرٌ وَإِنَّا بِهِ كَافِرُونَ ﴿30﴾";
    Dokhan_43_50 = "إِنَّ شَجَرَتَ الزَّقُّومِ ﴿43﴾ طَعَامُ الْأَثِيمِ ﴿44﴾ كَالْمُهْلِ يَغْلِي فِي الْبُطُونِ ﴿45﴾ كَغَلْيِ الْحَمِيمِ ﴿46﴾ خُذُوهُ فَاعْتِلُوهُ إِلَىٰ سَوَاءِ الْجَحِيمِ ﴿47﴾ ثُمَّ صُبُّوا فَوْقَ رَأْسِهِ مِنْ عَذَابِ الْحَمِيمِ ﴿48﴾ ذُقْ إِنَّكَ أَنْتَ الْعَزِيزُ الْكَرِيمُ ﴿49﴾ إِنَّ هَٰذَا مَا كُنْتُمْ بِهِ تَمْتَرُونَ ﴿50﴾";
    Jathia_6_11 = "تِلْكَ آيَاتُ اللَّهِ نَتْلُوهَا عَلَيْكَ بِالْحَقِّ ۖ فَبِأَيِّ حَدِيثٍ بَعْدَ اللَّهِ وَآيَاتِهِ يُؤْمِنُونَ ﴿6﴾ وَيْلٌ لِكُلِّ أَفَّاكٍ أَثِيمٍ ﴿7﴾ يَسْمَعُ آيَاتِ اللَّهِ تُتْلَىٰ عَلَيْهِ ثُمَّ يُصِرُّ مُسْتَكْبِرًا كَأَنْ لَمْ يَسْمَعْهَا ۖ فَبَشِّرْهُ بِعَذَابٍ أَلِيمٍ ﴿8﴾ وَإِذَا عَلِمَ مِنْ آيَاتِنَا شَيْئًا اتَّخَذَهَا هُزُوًا ۚ أُولَٰئِكَ لَهُمْ عَذَابٌ مُهِينٌ ﴿9﴾ مِنْ وَرَائِهِمْ جَهَنَّمُ ۖ وَلَا يُغْنِي عَنْهُمْ مَا كَسَبُوا شَيْئًا وَلَا مَا اتَّخَذُوا مِنْ دُونِ اللَّهِ أَوْلِيَاءَ ۖ وَلَهُمْ عَذَابٌ عَظِيمٌ ﴿10﴾ هَٰذَا هُدًى ۖ وَالَّذِينَ كَفَرُوا بِآيَاتِ رَبِّهِمْ لَهُمْ عَذَابٌ مِنْ رِجْزٍ أَلِيمٌ ﴿11﴾";
    Ahkaf_29_34 = "وَإِذْ صَرَفْنَا إِلَيْكَ نَفَرًا مِنَ الْجِنِّ يَسْتَمِعُونَ الْقُرْآنَ فَلَمَّا حَضَرُوهُ قَالُوا أَنْصِتُوا ۖ فَلَمَّا قُضِيَ وَلَّوْا إِلَىٰ قَوْمِهِمْ مُنْذِرِينَ ﴿29﴾ قَالُوا يَا قَوْمَنَا إِنَّا سَمِعْنَا كِتَابًا أُنْزِلَ مِنْ بَعْدِ مُوسَىٰ مُصَدِّقًا لِمَا بَيْنَ يَدَيْهِ يَهْدِي إِلَى الْحَقِّ وَإِلَىٰ طَرِيقٍ مُسْتَقِيمٍ ﴿30﴾ يَا قَوْمَنَا أَجِيبُوا دَاعِيَ اللَّهِ وَآمِنُوا بِهِ يَغْفِرْ لَكُمْ مِنْ ذُنُوبِكُمْ وَيُجِرْكُمْ مِنْ عَذَابٍ أَلِيمٍ ﴿31﴾ وَمَنْ لَا يُجِبْ دَاعِيَ اللَّهِ فَلَيْسَ بِمُعْجِزٍ فِي الْأَرْضِ وَلَيْسَ لَهُ مِنْ دُونِهِ أَوْلِيَاءُ ۚ أُولَٰئِكَ فِي ضَلَالٍ مُبِينٍ ﴿32﴾ أَوَلَمْ يَرَوْا أَنَّ اللَّهَ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وَلَمْ يَعْيَ بِخَلْقِهِنَّ بِقَادِرٍ عَلَىٰ أَنْ يُحْيِيَ الْمَوْتَىٰ ۚ بَلَىٰ إِنَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ ﴿33﴾ وَيَوْمَ يُعْرَضُ الَّذِينَ كَفَرُوا عَلَى النَّارِ أَلَيْسَ هَٰذَا بِالْحَقِّ ۖ قَالُوا بَلَىٰ وَرَبِّنَا ۚ قَالَ فَذُوقُوا الْعَذَابَ بِمَا كُنْتُمْ تَكْفُرُونَ ﴿34﴾";
    Mohammad_1 = "الَّذِينَ كَفَرُوا وَصَدُّوا عَنْ سَبِيلِ اللَّهِ أَضَلَّ أَعْمَالَهُمْ ﴿1﴾";
    Mohammad_9 = "ذَٰلِكَ بِأَنَّهُمْ كَرِهُوا مَا أَنْزَلَ اللَّهُ فَأَحْبَطَ أَعْمَالَهُمْ ﴿9﴾";
    Mohammad_28 = "ذَٰلِكَ بِأَنَّهُمُ اتَّبَعُوا مَا أَسْخَطَ اللَّهَ وَكَرِهُوا رِضْوَانَهُ فَأَحْبَطَ أَعْمَالَهُمْ ﴿28﴾";
    Mohammad_32 = "إِنَّ الَّذِينَ كَفَرُوا وَصَدُّوا عَنْ سَبِيلِ اللَّهِ وَشَاقُّوا الرَّسُولَ مِنْ بَعْدِ مَا تَبَيَّنَ لَهُمُ الْهُدَىٰ لَنْ يَضُرُّوا اللَّهَ شَيْئًا وَسَيُحْبِطُ أَعْمَالَهُمْ ﴿32﴾";
    Fat7_21 = "وَأُخْرَىٰ لَمْ تَقْدِرُوا عَلَيْهَا قَدْ أَحَاطَ اللَّهُ بِهَا ۚ وَكَانَ اللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرًا ﴿21﴾";
    Zariat_52 = "كَذَٰلِكَ مَا أَتَى الَّذِينَ مِنْ قَبْلِهِمْ مِنْ رَسُولٍ إِلَّا قَالُوا سَاحِرٌ أَوْ مَجْنُونٌ ﴿52﴾";
    TTur_15 = "أَفَسِحْرٌ هَٰذَا أَمْ أَنْتُمْ لَا تُبْصِرُونَ ﴿15﴾";
    KKamar_2 = "وَإِنْ يَرَوْا آيَةً يُعْرِضُوا وَيَقُولُوا سِحْرٌ مُسْتَمِرٌّ ﴿2﴾";
    Rahman_31_47 = "سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلَانِ ﴿31﴾ فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ﴿32﴾ يَا مَعْشَرَ الْجِنِّ وَالْإِنْسِ إِنِ اسْتَطَعْتُمْ أَنْ تَنْفُذُوا مِنْ أَقْطَارِ السَّمَاوَاتِ وَالْأَرْضِ فَانْفُذُوا ۚ لَا تَنْفُذُونَ إِلَّا بِسُلْطَانٍ ﴿33﴾ فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ﴿34﴾ يُرْسَلُ عَلَيْكُمَا شُوَاظٌ مِنْ نَارٍ وَنُحَاسٌ فَلَا تَنْتَصِرَانِ ﴿35﴾ فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ﴿36﴾ فَإِذَا انْشَقَّتِ السَّمَاءُ فَكَانَتْ وَرْدَةً كَالدِّهَانِ ﴿37﴾ فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ﴿38﴾ فَيَوْمَئِذٍ لَا يُسْأَلُ عَنْ ذَنْبِهِ إِنْسٌ وَلَا جَانٌّ ﴿39﴾ فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ﴿40﴾ يُعْرَفُ الْمُجْرِمُونَ بِسِيمَاهُمْ فَيُؤْخَذُ بِالنَّوَاصِي وَالْأَقْدَامِ ﴿41﴾ فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ﴿42﴾ هَٰذِهِ جَهَنَّمُ الَّتِي يُكَذِّبُ بِهَا الْمُجْرِمُونَ ﴿43﴾ يَطُوفُونَ بَيْنَهَا وَبَيْنَ حَمِيمٍ آنٍ ﴿44﴾ فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ﴿45﴾ وَلِمَنْ خَافَ مَقَامَ رَبِّهِ جَنَّتَانِ ﴿46﴾ فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ﴿47﴾";
    Momtahena_12 = "يَا أَيُّهَا النَّبِيُّ إِذَا جَاءَكَ الْمُؤْمِنَاتُ يُبَايِعْنَكَ عَلَىٰ أَنْ لَا يُشْرِكْنَ بِاللَّهِ شَيْئًا وَلَا يَسْرِقْنَ وَلَا يَزْنِينَ وَلَا يَقْتُلْنَ أَوْلَادَهُنَّ وَلَا يَأْتِينَ بِبُهْتَانٍ يَفْتَرِينَهُ بَيْنَ أَيْدِيهِنَّ وَأَرْجُلِهِنَّ وَلَا يَعْصِينَكَ فِي مَعْرُوفٍ ۙ فَبَايِعْهُنَّ وَاسْتَغْفِرْ لَهُنَّ اللَّهَ ۖ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ ﴿12﴾";
    Hashr_21_24End = "لَوْ أَنْزَلْنَا هَٰذَا الْقُرْآنَ عَلَىٰ جَبَلٍ لَرَأَيْتَهُ خَاشِعًا مُتَصَدِّعًا مِنْ خَشْيَةِ اللَّهِ ۚ وَتِلْكَ الْأَمْثَالُ نَضْرِبُهَا لِلنَّاسِ لَعَلَّهُمْ يَتَفَكَّرُونَ ﴿21﴾ هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ ۖ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ ۖ هُوَ الرَّحْمَٰنُ الرَّحِيمُ ﴿22﴾ هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ ۚ سُبْحَانَ اللَّهِ عَمَّا يُشْرِكُونَ ﴿23﴾ هُوَ اللَّهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ ۖ لَهُ الْأَسْمَاءُ الْحُسْنَىٰ ۚ يُسَبِّحُ لَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۖ وَهُوَ الْعَزِيزُ الْحَكِيمُ ﴿24﴾";
    TalaQuePartOf_2_3 = "وَمَنْ يَتَّقِ اللَّهَ يَجْعَلْ لَهُ مَخْرَجًا ﴿2﴾ وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ ۚ وَمَنْ يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ ۚ إِنَّ اللَّهَ بَالِغُ أَمْرِهِ ۚ قَدْ جَعَلَ اللَّهُ لِكُلِّ شَيْءٍ قَدْرًا ﴿3﴾";
    TalaQue_4 = "وَاللَّائِي يَئِسْنَ مِنَ الْمَحِيضِ مِنْ نِسَائِكُمْ إِنِ ارْتَبْتُمْ فَعِدَّتُهُنَّ ثَلَاثَةُ أَشْهُرٍ وَاللَّائِي لَمْ يَحِضْنَ ۚ وَأُولَاتُ الْأَحْمَالِ أَجَلُهُنَّ أَنْ يَضَعْنَ حَمْلَهُنَّ ۚ وَمَنْ يَتَّقِ اللَّهَ يَجْعَلْ لَهُ مِنْ أَمْرِهِ يُسْرًا ﴿4﴾";
    TalaQue_7 = "لِيُنْفِقْ ذُو سَعَةٍ مِنْ سَعَتِهِ ۖ وَمَنْ قُدِرَ عَلَيْهِ رِزْقُهُ فَلْيُنْفِقْ مِمَّا آتَاهُ اللَّهُ ۚ لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا مَا آتَاهَا ۚ سَيَجْعَلُ اللَّهُ بَعْدَ عُسْرٍ يُسْرًا ﴿7﴾";
    Qalam_51_52End = "وَإِنْ يَكَادُ الَّذِينَ كَفَرُوا لَيُزْلِقُونَكَ بِأَبْصَارِهِمْ لَمَّا سَمِعُوا الذِّكْرَ وَيَقُولُونَ إِنَّهُ لَمَجْنُونٌ ﴿51﴾ وَمَا هُوَ إِلَّا ذِكْرٌ لِلْعَالَمِينَ ﴿52﴾";
    Noo7_22 = "وَمَكَرُوا مَكْرًا كُبَّارًا ﴿22﴾";
    Gen_1_15 = "قُلْ أُوحِيَ إِلَيَّ أَنَّهُ اسْتَمَعَ نَفَرٌ مِنَ الْجِنِّ فَقَالُوا إِنَّا سَمِعْنَا قُرْآنًا عَجَبًا ﴿1﴾ يَهْدِي إِلَى الرُّشْدِ فَآمَنَّا بِهِ ۖ وَلَنْ نُشْرِكَ بِرَبِّنَا أَحَدًا ﴿2﴾ وَأَنَّهُ تَعَالَىٰ جَدُّ رَبِّنَا مَا اتَّخَذَ صَاحِبَةً وَلَا وَلَدًا ﴿3﴾ وَأَنَّهُ كَانَ يَقُولُ سَفِيهُنَا عَلَى اللَّهِ شَطَطًا ﴿4﴾ وَأَنَّا ظَنَنَّا أَنْ لَنْ تَقُولَ الْإِنْسُ وَالْجِنُّ عَلَى اللَّهِ كَذِبًا ﴿5﴾ وَأَنَّهُ كَانَ رِجَالٌ مِنَ الْإِنْسِ يَعُوذُونَ بِرِجَالٍ مِنَ الْجِنِّ فَزَادُوهُمْ رَهَقًا ﴿6﴾ وَأَنَّهُمْ ظَنُّوا كَمَا ظَنَنْتُمْ أَنْ لَنْ يَبْعَثَ اللَّهُ أَحَدًا ﴿7﴾ وَأَنَّا لَمَسْنَا السَّمَاءَ فَوَجَدْنَاهَا مُلِئَتْ حَرَسًا شَدِيدًا وَشُهُبًا ﴿8﴾ وَأَنَّا كُنَّا نَقْعُدُ مِنْهَا مَقَاعِدَ لِلسَّمْعِ ۖ فَمَنْ يَسْتَمِعِ الْآنَ يَجِدْ لَهُ شِهَابًا رَصَدًا ﴿9﴾ وَأَنَّا لَا نَدْرِي أَشَرٌّ أُرِيدَ بِمَنْ فِي الْأَرْضِ أَمْ أَرَادَ بِهِمْ رَبُّهُمْ رَشَدًا ﴿10﴾ وَأَنَّا مِنَّا الصَّالِحُونَ وَمِنَّا دُونَ ذَٰلِكَ ۖ كُنَّا طَرَائِقَ قِدَدًا ﴿11﴾ وَأَنَّا ظَنَنَّا أَنْ لَنْ نُعْجِزَ اللَّهَ فِي الْأَرْضِ وَلَنْ نُعْجِزَهُ هَرَبًا ﴿12﴾ وَأَنَّا لَمَّا سَمِعْنَا الْهُدَىٰ آمَنَّا بِهِ ۖ فَمَنْ يُؤْمِنْ بِرَبِّهِ فَلَا يَخَافُ بَخْسًا وَلَا رَهَقًا ﴿13﴾ وَأَنَّا مِنَّا الْمُسْلِمُونَ وَمِنَّا الْقَاسِطُونَ ۖ فَمَنْ أَسْلَمَ فَأُولَٰئِكَ تَحَرَّوْا رَشَدًا ﴿14﴾ وَأَمَّا الْقَاسِطُونَ فَكَانُوا لِجَهَنَّمَ حَطَبًا ﴿15﴾";
    Gen_28End = "لِيَعْلَمَ أَنْ قَدْ أَبْلَغُوا رِسَالَاتِ رَبِّهِمْ وَأَحَاطَ بِمَا لَدَيْهِمْ وَأَحْصَىٰ كُلَّ شَيْءٍ عَدَدًا ﴿28﴾";
    Muzammel_9 = "رَبُّ الْمَشْرِقِ وَالْمَغْرِبِ لَا إِلَٰهَ إِلَّا هُوَ فَاتَّخِذْهُ وَكِيلًا ﴿9﴾";
    Muddather_21_24 = "ثُمَّ نَظَرَ ﴿21﴾ ثُمَّ عَبَسَ وَبَسَرَ ﴿22﴾ ثُمَّ أَدْبَرَ وَاسْتَكْبَرَ ﴿23﴾ فَقَالَ إِنْ هَٰذَا إِلَّا سِحْرٌ يُؤْثَرُ ﴿24﴾";
    Enfetar_10 = "وَإِنَّ عَلَيْكُمْ لَحَافِظِينَ ﴿10﴾";
    Prooj_20 = "وَاللَّهُ مِنْ وَرَائِهِمْ مُحِيطٌ ﴿20﴾";
    Tareque_4 = "إِنْ كُلُّ نَفْسٍ لَمَّا عَلَيْهَا حَافِظٌ ﴿4﴾";
    Zalzala_1_8End = "إِذَا زُلْزِلَتِ الْأَرْضُ زِلْزَالَهَا ﴿1﴾ وَأَخْرَجَتِ الْأَرْضُ أَثْقَالَهَا ﴿2﴾ وَقَالَ الْإِنْسَانُ مَا لَهَا ﴿3﴾ يَوْمَئِذٍ تُحَدِّثُ أَخْبَارَهَا ﴿4﴾ بِأَنَّ رَبَّكَ أَوْحَىٰ لَهَا ﴿5﴾ يَوْمَئِذٍ يَصْدُرُ النَّاسُ أَشْتَاتًا لِيُرَوْا أَعْمَالَهُمْ ﴿6﴾ فَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ ﴿7﴾ وَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ ﴿8﴾";
    Kaferoun_1_6End = "قُلْ يَا أَيُّهَا الْكَافِرُونَ ﴿1﴾ لَا أَعْبُدُ مَا تَعْبُدُونَ ﴿2﴾ وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ ﴿3﴾ وَلَا أَنَا عَابِدٌ مَا عَبَدْتُمْ ﴿4﴾ وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ ﴿5﴾ لَكُمْ دِينُكُمْ وَلِيَ دِينِ ﴿6﴾";
    Ekhlas_1_4End = "قُلْ هُوَ اللَّهُ أَحَدٌ ﴿1﴾ اللَّهُ الصَّمَدُ ﴿2﴾ لَمْ يَلِدْ وَلَمْ يُولَدْ ﴿3﴾ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ ﴿4﴾";
    Falaque_1_5End = "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ﴿1﴾ مِنْ شَرِّ مَا خَلَقَ ﴿2﴾ وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ ﴿3﴾ وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ﴿4﴾ وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ ﴿5﴾";
    Nas_1_6End = "قُلْ أَعُوذُ بِرَبِّ النَّاسِ ﴿1﴾ مَلِكِ النَّاسِ ﴿2﴾ إِلَٰهِ النَّاسِ ﴿3﴾ مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ﴿4﴾ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ﴿5﴾ مِنَ الْجِنَّةِ وَالنَّاسِ ﴿6﴾";

    // this.BaQura_1_5.slice(this.BaQura_1_5.indexOf("﴿2﴾") + 4, this.BaQura_1_5.indexOf("﴿5﴾") + 4);
    constructor() {

    }
    BasmalaLaYDor = "بِسمِ اللهِ الذي لا يضرُّ مع اسمِهِ شَيءٌ في الأرضِ ولا في السماءِ وهوَ السميعُ العليم";
    EsteazaKalemat = "أعُوذَ بكلماتِ اللهِ التامَّاتِ من شرِ ما خلق";
    EsteazaKalemat2 = "أعوذُ بكلماتِ اللهِ التامَّات من غضبِهِ وعقابهِ وشرِّ عبادهِ .. ومن همزاتِ الشيطينَ وأن يحضرون";
    EsteazaKalemat3 = "أعوذُ بكلماتِ اللهِ التامّة .. من كلِ شيطانٍ وهامَّة .. ومن كلِّ عينٍ لامَّة";
    EsteazaKalemat4 = "أعوذُ بكلماتِ اللهِ التامَّات التي لا يجاوِزهُنَّ برٌّ ولا فاجِر .. من شرِّ ما خلقَ وذرأَ وبرأَ .. ومن شرِّ ما يَنزِلُ منَ السماءِ ومن شرِّ ما يَعرُجُ فيها .. ومن شرِّ ما ذَرَأَ في الأرضِ ومن شَرِّ ما يَخرُجُ منها .. ومن شَرِّ فِتَنِ الليلِ والنَّهارِ .. ومن شَرِّ كلِّ طارقٍ إلّا طارقاً يطرُقُ بخيرٍ يا رَحمَن";
    EsteazaKalemat5 = "أَعُوذُ باللهِ العَظيمِ وبوجههِ الكَريمِ وسُلطانِهِ القديمِ مِنَ الشيطانِ الرجيم";
    Esteaza = "أعوذُ باللهِ مِنَ الشيطانِ الرَّجيم";
    Hasbana = "حَسبِيَ اللهُ لا إلَهَ إلّا هُوَ عليهِ توكلتُ وهُوَ ربُّ العَرشِ العَظيم";
    Hasbana2 = "حَسبيَ اللهُ ونِعمَ الوكيل ؛ حسبيَ الرَّبُّ منَ العبادِ ؛ حَسبيَ الخالِقُ منَ المخلوقِ ؛ حَسبيَ الرازِقُ من المرزوقِ ؛ حَسبيَ اللهُ الذي هوَ حسبي ؛ حسبيَ الذي بيَدِهِ مَلَكُوتُ كلِّ شَيء ؛ وهوَ يُجِيرُ ولا يُجَارُ عَليهِ ؛ حَسبيَ اللهُ وكفى ؛ وسَمِعَ اللهُ لِمَن دَعَا ؛ وليسَ وراء اللهِ مرمى";
    Doaa1 = "اللهمَّ رحمَتَكَ أَرجُو فَلا تَكِلنِي إلى نَفسي طرفةَ عينٍ .. وأصلِح لي شأني كلَّهُ .. لاإلَهَ إلّا أنت";
    Doaa2 = "اللهُمَّ إنِّي أَعُوذُ بِكَ مِن جَهدِ البَلاء .. ودَرَكِ الشقاءِ وسُوءِ القضاءِ وشماتة الأعداء";
    Doaa3 = "اللهُمَّ ذا السُلطانِ العظيمِ والمَنِّ القَديمِ وليُّ الكلماتِ التامَّاتِ والدعواتِ المُستَجَاباتِ اصرف عنِّي عيونَ العائنين وحَسدَ الحاسدين وسِحرَ الساحرين";
    Doaa4 = "اللهُمَّ اصرف عنِّي ما أصابَنِي مِن حَسَدِ الأقرِباءِ والأَصدِقاءِ والزُمَلاءِ ؛ والجيرانَ وحَسَدِ الرجالِ والنساءِ وما أصابني من أعيُنِ الإنسِ وأنفُسِ الجِنّ";
    Doaa5 = "اللهُمَّ إنِّي أسألُكَ باسمكَ الأَعظَم ؛ الذي إذا دُعِيتَ بهِ أّجَبتَ ؛ وإذا سُؤِلتَ بِهِ أَعطَيتَ وإذا استُعِذتَ بهِ أَعَذتَ ؛ اللهُمَّ أهلِكَ كُلَّ من طَغى وبَغى عليَّ وعلىَ عِبادِكَ المُسلمينَ من الحَسَدَةِ والسحرةِ والشياطينَ من المَرَدةِ والعفاريتَ والمارِداتِ والعفريتاتِ";
    Doaa6 = "تَحَصَّنتُ (وحصَّنتُكَ) باللهِ الذي لا إلَهَ إلّا هوَ ؛ إلَهِي وإلَهُكَ وإلَهُ كلِّ شيءٍ ؛ وتوكلتُ على الحيِّ الذي لا يموت واستدفعتُ الشرَّ بلا حولَ ولا قوةَ إلّا باللهِ";
    Doaa7 = "رَبَّنا الذي في السماءِ تقدسَ اسمُك ؛ أمرُكَ في السماءِ والأرضِ ؛ اللهمَّ كما أمرُكَ في السماءِ فاجعل رَحمَتِكَ علينا في الأرضِ ؛ اللهُمَّ ربّ العالمينَ اغفر لنا حُوبَنا وذِنُوبَنا وخطايانا ؛ وانزل رحمةً من رحماتِكَ وشفاءً من شفاءِكَ عليَّ وعلىَ عبادِك من شكوايَ وشكواهُم";
    AgedWaOhazer = "بسمِ اللهِ ؛ أعوذُ باللهِ من شَرِّ ما أجدُ و أُحاذِر";
    doaaRoquia1() {
        return `أعوذُ باللهِ السميعِ العليم من الشيطانِ الرجيم من همزهِ ونفثهِ ونفخِهِ 
أشهدُ أن لا إله إلّا الله وحده لا شريك لهُ وأشهدُ أن محمداً عبدهُ ورسولُه
َ اللهمَّ لكَ الحمدُ وإليكَ المشتكى وأنت المستعانُ وعليك التكلان .. ولا حولَ ولا قوةَ إلّا باللهِ العليِّ العظيم
لا إله إلّا اللهُ العظيمُ الحليمُ .. لا إلهَ إلّا اللهُ ربُّ العرشِ العظيم .. لا إلهَ إلّا اللهُ ربُّ السماواتِ وربُّ الأرضِ وربُّ العرشِ الكريم\n
${this.BasmalaLaYDor}\n(ثلاث مرات)\n\n${this.EsteazaKalemat}\n(ثلاث مرات)\n\n${this.EsteazaKalemat2}
${this.EsteazaKalemat3}\n${this.EsteazaKalemat4}\n${this.EsteazaKalemat5}\n\n${this.Hasbana}\n(سبع مرات)\n
${this.Doaa1}\n${this.Doaa2}\n${this.Doaa3}\n${this.Doaa4}\n${this.Doaa5}\n${this.Doaa6}\n${this.Hasbana2} ؛ ${this.Hasbana}
${this.Doaa7}\n\n${this.AgedWaOhazer}\n(ثلاث مرات)`;
    }
    generalRoquia() {
        return `الرُقيَة الكَامِلَة
        ${this.hr}\n
        ${this.doaaRoquia1()}\n${this.hr}\n 
        ${this.Esteaza}
        ${this.Basmala}﴿1﴾
        ${this.Fateha}\n﴿﴿${this.sora["1"]}﴾﴾
         ${this.hr}\n
        ${this.Basmala} 
        ${this.BaQura_1_5}\n﴿﴿${this.sora["2"]}﴾﴾\n 
        ${this.BaQura_102_103}\n﴿﴿${this.sora["2"]}﴾﴾\n 
        ${this.BaQura_148}\n﴿﴿${this.sora["2"]}﴾﴾\n
        ${this.BaQura_163_164}\n﴿﴿${this.sora["2"]}﴾﴾\n
        ${this.ElKorsey} ${this.BaQura_256_257}\n﴿﴿${this.sora["2"]}﴾﴾\n
        ${this.BaQura_284_End}\n﴿﴿${this.sora["2"]}﴾﴾
         ${this.hr}\n
        ${this.Basmala}
        ${this.Al_Omran_1_5}\n﴿﴿${this.sora["3"]}﴾﴾\n
        ${this.Al_Omran_18_19}\n﴿﴿${this.sora["3"]}﴾﴾\n
        ${this.Al_Omran_26_27}\n﴿﴿${this.sora["3"]}﴾﴾
         ${this.hr}\n
        ${this.Nesa_54_56}\n﴿﴿${this.sora["4"]}﴾﴾\n
        ${this.Nesa_167_170}\n﴿﴿${this.sora["4"]}﴾﴾
         ${this.hr}\n
        ${this.Maeda_33_37}\n﴿﴿${this.sora["5"]}﴾﴾
         ${this.hr}\n
        ${this.Anaam_128_134}\n﴿﴿${this.sora["6"]}﴾﴾
         ${this.hr}\n
        ${this.Aaraf_54_56}\n﴿﴿${this.sora["7"]}﴾﴾\n
        ${this.Aaraf_104_122}\n﴿﴿${this.sora["7"]}﴾﴾
         ${this.hr}\n
        ${this.Anfal_12_14}\n﴿﴿${this.sora["8"]}﴾﴾\n
        ${this.Anfal_17_19}\n﴿﴿${this.sora["8"]}﴾﴾\n
        ${this.Anfal_50_52}\n﴿﴿${this.sora["8"]}﴾﴾
         ${this.hr}\n
        ${this.Taoba_14_15}\n﴿﴿${this.sora["9"]}﴾﴾
         ${this.hr}\n
        ${this.Younes_57_58}\n﴿﴿${this.sora["10"]}﴾﴾\n
        ${this.Younes_77_82}\n﴿﴿${this.sora["10"]}﴾﴾
         ${this.hr}\n
        ${this.Ibrahim_12}\n﴿﴿${this.sora["14"]}﴾﴾\n
        ${this.Ibrahim_15_17}\n﴿﴿${this.sora["14"]}﴾﴾\n
        ${this.Ibrahim_49_51}\n﴿﴿${this.sora["14"]}﴾﴾
         ${this.hr}\n
        ${this.Hegr_34_35}\n﴿﴿${this.sora["15"]}﴾﴾
         ${this.hr}\n
        ${this.Israa_81_82}\n﴿﴿${this.sora["17"]}﴾﴾
         ${this.hr}\n
        ${this.Kahf_39}\n﴿﴿${this.sora["18"]}﴾﴾
        ${this.hr}\n
        ${this.Mariam_68_75}\n﴿﴿${this.sora["19"]}﴾﴾
        ${this.hr}\n
        ${this.Taha_56_70}\n﴿﴿${this.sora["20"]}﴾﴾
        ${this.hr}\n
        ${this.Anbiaa_10_18}\n﴿﴿${this.sora["21"]}﴾﴾
        ${this.hr}\n
        ${this.Hej_19_22}\n﴿﴿${this.sora["22"]}﴾﴾
        ${this.hr}\n
        ${this.Moamenoun_97_108}\n﴿﴿${this.sora["23"]}﴾﴾\n
        ${this.Moamenoun_115_118End}\n﴿﴿${this.sora["23"]}﴾﴾
        ${this.hr}\n
        ${this.Nour_35}\n﴿﴿${this.sora["24"]}﴾﴾
        ${this.hr}\n
        ${this.Forquan_21_23}\n﴿﴿${this.sora["25"]}﴾﴾
        ${this.hr}\n
        ${this.Shouaraa_43_48}\n﴿﴿${this.sora["26"]}﴾﴾\n
        ${this.Shouaraa_75_85}\n﴿﴿${this.sora["26"]}﴾﴾
        ${this.hr}\n
        ${this.Naml_30_31}\n﴿﴿${this.sora["27"]}﴾﴾
        ${this.hr}\n
        ${this.Sabaa_12}\n﴿﴿${this.sora["34"]}﴾﴾\n
        ${this.Sabaa_48_49}\n﴿﴿${this.sora["34"]}﴾﴾ - ثلاث مرات
        ${this.hr}\n
        ${this.Basmala}
        ${this.Yaseen_1_12}\n﴿﴿${this.sora["36"]}﴾﴾\n
        ${this.Yaseen_49_53}\n﴿﴿${this.sora["36"]}﴾﴾
        ${this.hr}\n
        ${this.Basmala}
        ${this.Saffat_1_10}\n﴿﴿${this.sora["37"]}﴾﴾\n
        ${this.Saffat_62_73}\n﴿﴿${this.sora["37"]}﴾﴾\n
        ${this.Saffat_158_159}\n﴿﴿${this.sora["37"]}﴾﴾
        ${this.hr}\n
        ${this.Dokhan_43_50}\n﴿﴿${this.sora["44"]}﴾﴾
        ${this.hr}\n
        ${this.Jathia_6_11}\n﴿﴿${this.sora["45"]}﴾﴾
        ${this.hr}\n
        ${this.Ahkaf_29_34}\n﴿﴿${this.sora["46"]}﴾﴾
        ${this.hr}\n
        ${this.Rahman_31_47}\n﴿﴿${this.sora["55"]}﴾﴾
        ${this.hr}\n
        ${this.Hashr_21_24End}\n﴿﴿${this.sora["59"]}﴾﴾
        ${this.hr}\n
        ${this.Qalam_51_52End}\n﴿﴿${this.sora["68"]}﴾﴾
        ${this.hr}\n
        ${this.Basmala}
        ${this.Gen_1_15}\n﴿﴿${this.sora["72"]}﴾﴾
        ${this.hr}\n
        ${this.Basmala}
        ${this.Zalzala_1_8End}\n﴿﴿${this.sora["99"]}﴾﴾
        ${this.hr}\n
        ${this.Basmala}
        ${this.Kaferoun_1_6End}\n﴿﴿${this.sora["109"]}﴾﴾
        ${this.hr}\n
        ${this.Basmala}
        ${this.Ekhlas_1_4End}\n﴿﴿${this.sora["112"]}﴾﴾ - ثلاث مرات
        ${this.hr}\n
        ${this.Basmala}
        ${this.Falaque_1_5End}\n﴿﴿${this.sora["113"]}﴾﴾ - ثلاث مرات
        ${this.hr}\n
        ${this.Basmala}
        ${this.Nas_1_6End}\n﴿﴿${this.sora["114"]}﴾﴾ - ثلاث مرات
        ${this.hr}\n`;

    }
    smallRoquia() {
        return `الرُقيَة المُختَصَرَة
        ${this.hr}\n
        ${this.Esteaza}
        ${this.Basmala}﴿1﴾
        ${this.Fateha}\n﴿﴿${this.sora["1"]}﴾﴾
        ${this.hr}\n
        ${this.Basmala} 
        ${this.BaQura_1_5}\n﴿﴿${this.sora["2"]}﴾﴾\n
        ${this.BaQura_163_164}\n﴿﴿${this.sora["2"]}﴾﴾\n
        ${this.ElKorsey}\n﴿﴿${this.sora["2"]}﴾﴾\n
        ${this.BaQura_284_End.slice(this.BaQura_284_End.indexOf("﴿284﴾") + 5)}\n﴿﴿${this.sora["2"]}﴾﴾
        ${this.hr}\n
        ${this.Al_Omran_18_19.slice(0, this.Al_Omran_18_19.indexOf("﴿18﴾") + 4)}\n﴿﴿${this.sora["3"]}﴾﴾
        ${this.hr}\n
        ${this.Aaraf_54_56}\n﴿﴿${this.sora["7"]}﴾﴾
        ${this.hr}\n
        ${this.Moamenoun_115_118End}\n﴿﴿${this.sora["23"]}﴾﴾
        ${this.hr}\n
        ${this.Basmala}
        ${this.Saffat_1_10}\n﴿﴿${this.sora["37"]}﴾﴾
        ${this.hr}\n
        ${this.Rahman_31_47.slice(this.Rahman_31_47.indexOf("﴿32﴾") + 5, this.Rahman_31_47.indexOf("﴿36﴾") + 4)}\n﴿﴿${this.sora["55"]}﴾﴾
        ${this.hr}\n
        ${this.Hashr_21_24End}\n﴿﴿${this.sora["59"]}﴾﴾
        ${this.hr}\n
        ${this.Qalam_51_52End}\n﴿﴿${this.sora["68"]}﴾﴾
        ${this.hr}\n
        ${this.Gen_1_15.slice(this.Gen_1_15.indexOf("﴿2﴾") + 4, this.Gen_1_15.indexOf("﴿3﴾") + 4)}\n﴿﴿${this.sora["72"]}﴾﴾
        ${this.hr}\n
        ${this.Basmala}
        ${this.Ekhlas_1_4End}\n﴿﴿${this.sora["112"]}﴾﴾ - ثلاث مرات
        ${this.hr}\n
        ${this.Basmala}
        ${this.Falaque_1_5End}\n﴿﴿${this.sora["113"]}﴾﴾ - ثلاث مرات
        ${this.hr}\n
        ${this.Basmala}
        ${this.Nas_1_6End}\n﴿﴿${this.sora["114"]}﴾﴾ - ثلاث مرات
        ${this.hr}\n`;
    }

    ayatElsehr() {
        return `آياتُ إبطال السِحر
        ${this.hr}\n
        ${this.Esteaza}
        ${this.Basmala}﴿1﴾
        ${this.Fateha}\n﴿﴿${this.sora["1"]}﴾﴾
        ${this.hr}\n
        ${this.BaQura_102_103.slice(0, this.BaQura_102_103.indexOf("﴿102﴾") + 4)}
        ﴿﴿${this.sora["2"]}﴾﴾\n
        .. ${this.BaQura_137.slice(this.BaQura_137.indexOf("وَإِنْ تَوَلَّوْا"))}\n﴿﴿${this.sora["2"]}﴾﴾\n
        .. ${this.BaQura_235_237.slice(this.BaQura_235_237.indexOf("وَلَا تَعْزِمُوا"), this.BaQura_235_237.indexOf(" حَتَّىٰ يَبْلُغَ"))} .. ﴿235﴾
        ﴿﴿${this.sora["2"]}﴾﴾\n
        .. ${this.BaQura_235_237.slice(this.BaQura_235_237.indexOf("أَوْ يَعْفُوَ"), this.BaQura_235_237.indexOf(" ۚ وَأَنْ تَعْفُوا"))} .. ﴿237﴾
        ﴿﴿${this.sora["2"]}﴾﴾\n
        .. ${this.ElKorsey.slice(this.ElKorsey.indexOf("وَلَا يَئُودُهُ"))}\n﴿﴿${this.sora["2"]}﴾﴾
        ${this.hr}\n
        ${this.Al_Omran_22}\n﴿﴿${this.sora["3"]}﴾﴾\n
        ${this.Al_Omran_54}\n﴿﴿${this.sora["3"]}﴾﴾\n
        ${this.Al_Omran_111}\n﴿﴿${this.sora["3"]}﴾﴾\n
        .. ${this.Al_Omran_120.slice(this.Al_Omran_120.indexOf("وَإِنْ تَصْبِرُوا"))}
        ﴿﴿${this.sora["3"]}﴾﴾
        ${this.hr}\n
        ${this.Nesa_45}\n﴿﴿${this.sora["4"]}﴾﴾\n
        .. ${this.Nesa_81.slice(this.Nesa_81.indexOf("وَاللَّهُ يَكْتُبُ"))}\n﴿﴿${this.sora["4"]}﴾﴾\n
        ${this.Nesa_126}\n﴿﴿${this.sora["4"]}﴾﴾
        ${this.hr}\n
        ${this.Maeda_11}\n﴿﴿${this.sora["5"]}﴾﴾\n
        ${this.Maeda_23}\n﴿﴿${this.sora["5"]}﴾﴾\n
        .. ${this.Maeda_42.slice(this.Maeda_42.indexOf("وَإِنْ تُعْرِضْ"), this.Maeda_42.indexOf(" وَإِنْ حَكَمْتَ"))} .. ﴿42﴾\n﴿﴿${this.sora["5"]}﴾﴾
        ${this.hr}\n
        ${this.Anaam_7}\n﴿﴿${this.sora["6"]}﴾﴾\n
        ${this.Anaam_17}\n﴿﴿${this.sora["6"]}﴾﴾\n
        ${this.Anaam_61}\n﴿﴿${this.sora["6"]}﴾﴾\n
        .. ${this.Anaam_124.slice(this.Anaam_124.indexOf("سَيُصِيبُ"))}\n﴿﴿${this.sora["6"]}﴾﴾
        ${this.hr}\n
        ${this.Aaraf_104_122} ${this.Aaraf_123_126}\n﴿﴿${this.sora["7"]}﴾﴾\n
        ${this.Aaraf_132}\n﴿﴿${this.sora["7"]}﴾﴾\n
        ${this.Aaraf_139}\n﴿﴿${this.sora["7"]}﴾﴾\n
        ${this.Aaraf_147}\n﴿﴿${this.sora["7"]}﴾﴾
        ${this.hr}\n
        .. ${this.Anfal_7_8.slice(this.Anfal_7_8.indexOf("وَيُرِيدُ"))}\n﴿﴿${this.sora["8"]}﴾﴾\n
        ${this.Anfal_30}\n﴿﴿${this.sora["8"]}﴾﴾
        ${this.hr}\n
        ${this.Taoba_51}\n﴿﴿${this.sora["9"]}﴾﴾\n
        ${this.Taoba_129}\n﴿﴿${this.sora["9"]}﴾﴾
        ${this.hr}\n
        ${this.Younes_2}\n﴿﴿${this.sora["10"]}﴾﴾\n
        .. ${this.Younes_61.slice(this.Younes_61.indexOf("وَلَا تَعْمَلُونَ"), this.Younes_61.indexOf(" إِذْ"))} .. ﴿61﴾\n﴿﴿${this.sora["10"]}﴾﴾\n
        ${this.Younes_76} ${this.Younes_77_82}\n﴿﴿${this.sora["10"]}﴾﴾\n
        ${this.Younes_85}\n﴿﴿${this.sora["10"]}﴾﴾\n
        ${this.Younes_107}\n﴿﴿${this.sora["10"]}﴾﴾
        ${this.hr}\n
        ${this.Hood_7}\n﴿﴿${this.sora["11"]}﴾﴾\n
        ${this.Hood_16}\n﴿﴿${this.sora["11"]}﴾﴾\n
        .. إِنَّهُ عَمَلٌ غَيْرُ صَالِحٍ ۖ .. ﴿46﴾\n﴿﴿${this.sora["11"]}﴾﴾\n
        ${this.Hood_56_57.slice(0, this.Hood_56_57.indexOf(" فَإِنْ"))}\n﴿﴿${this.sora["11"]}﴾﴾\n
        .. ${this.Hood_56_57.slice(this.Hood_56_57.lastIndexOf(" إِنَّ رَبِّ"))}\n﴿﴿${this.sora["11"]}﴾﴾\n
        .. ${this.Hood_88.slice(this.Hood_88.indexOf("إِنْ أُرِيدُ"))}\n﴿﴿${this.sora["11"]}﴾﴾\n
        ${this.Hood_92}\n﴿﴿${this.sora["11"]}﴾﴾
        ${this.hr}\n
        .. ${this.Yousef_64.slice(this.Yousef_64.indexOf("فَاللَّ"))}\n﴿﴿${this.sora["12"]}﴾﴾\n
        .. ${this.Yousef_67.slice(this.Yousef_67.indexOf("إِنِ الْحُكْمُ"))}\n﴿﴿${this.sora["12"]}﴾﴾
        ${this.hr}\n
        ${this.Ra3d_11.slice(0, this.Ra3d_11.indexOf(" إِنَّ"))} .. ﴿11﴾\n﴿﴿${this.sora["13"]}﴾﴾
        ${this.hr}\n
        ${this.Ibrahim_18}\n﴿﴿${this.sora["14"]}﴾﴾
        ${this.hr}\n
        ${this.Hegr_14_15}\n﴿﴿${this.sora["15"]}﴾﴾\n\n${this.Hegr_17}\n﴿﴿${this.sora["15"]}﴾﴾
        ${this.hr}\n
        ${this.Na7l_26_28.slice(0, this.Na7l_26_28.indexOf(" ثُمَّ"))}\n﴿﴿${this.sora["16"]}﴾﴾\n
        ${this.Na7l_26_28.slice(this.Na7l_26_28.indexOf("الَّذِينَ تَتَوَفَّاهُمُ"))}\n﴿﴿${this.sora["16"]}﴾﴾\n
        ${this.Na7l_34}\n﴿﴿${this.sora["16"]}﴾﴾\n
        .. ${this.Na7l_69.slice(this.Na7l_69.indexOf("يَخْرُجُ"), this.Na7l_69.indexOf(" شَرَابٌ"))} .. ﴿69﴾\n﴿﴿${this.sora["16"]}﴾﴾\n
        ${this.Na7l_127}\n﴿﴿${this.sora["16"]}﴾﴾
        ${this.hr}\n
        ${this.Israa_45_47}\n﴿﴿${this.sora["17"]}﴾﴾\n
        ${this.Israa_65}\n﴿﴿${this.sora["17"]}﴾﴾\n
        ${this.Israa_81_82.slice(0, this.Israa_81_82.indexOf("﴿81﴾") + 4)}\n﴿﴿${this.sora["17"]}﴾﴾\n
        ${this.Israa_101}\n﴿﴿${this.sora["17"]}﴾﴾
        ${this.hr}\n
        ${this.Kahf_91}\n﴿﴿${this.sora["18"]}﴾﴾\n
        ${this.Kahf_98}\n﴿﴿${this.sora["18"]}﴾﴾
        ${this.hr}\n
        ${this.Taha_27}\n﴿﴿${this.sora["20"]}﴾﴾\n
        ${this.Taha_56_70} ${this.Taha_71} ${this.Taha_72_76}\n﴿﴿${this.sora["20"]}﴾﴾
        ${this.hr}\n
        ${this.Anbiaa_1_3}\n﴿﴿${this.sora["21"]}﴾﴾\n
        ${this.Anbiaa_10_18.slice(this.Anbiaa_10_18.indexOf("﴿17﴾") + 4)}\n﴿﴿${this.sora["21"]}﴾﴾\n
        ${this.Anbiaa_30}\n﴿﴿${this.sora["21"]}﴾﴾\n
        .. ${this.Anbiaa_52.slice(this.Anbiaa_52.indexOf("مَا"))}\n﴿﴿${this.sora["21"]}﴾﴾\n
        ${this.Anbiaa_70}\n﴿﴿${this.sora["21"]}﴾﴾\n
        ${this.Anbiaa_74}\n﴿﴿${this.sora["21"]}﴾﴾\n
        ${this.Anbiaa_82}\n﴿﴿${this.sora["21"]}﴾﴾\n
        ${this.Anbiaa_83_84}\n﴿﴿${this.sora["21"]}﴾﴾
        ${this.hr}\n
        ${this.Hej_19_22.slice(this.Hej_19_22.indexOf("﴿19﴾") + 4, this.Hej_19_22.indexOf("﴿20﴾") + 4)}\n﴿﴿${this.sora["22"]}﴾﴾\n
        ${this.Hej_62}\n﴿﴿${this.sora["22"]}﴾﴾
        ${this.hr}\n
        ${this.Moamenoun_63}\n﴿﴿${this.sora["23"]}﴾﴾\n
        ${this.Moamenoun_88_89}\n﴿﴿${this.sora["23"]}﴾﴾
        ${this.hr}\n
        ${this.Nour_39}\n﴿﴿${this.sora["24"]}﴾﴾
        ${this.hr}\n
        ${this.Forquan_7_8}\n﴿﴿${this.sora["25"]}﴾﴾\n
        ${this.Forquan_21_23.slice(this.Forquan_21_23.indexOf("﴿22﴾") + 4)}\n﴿﴿${this.sora["25"]}﴾﴾
        ${this.hr}\n
        ${this.Shouaraa_34_42} ${this.Shouaraa_43_48} ${this.Shouaraa_49_51}\n﴿﴿${this.sora["26"]}﴾﴾\n
        ${this.Shouaraa_153}\n﴿﴿${this.sora["26"]}﴾﴾\n
        ${this.Shouaraa_168_170}\n﴿﴿${this.sora["26"]}﴾﴾
        ${this.hr}\n
        ${this.Naml_13}\n﴿﴿${this.sora["27"]}﴾﴾\n
        ${this.Naml_22}\n﴿﴿${this.sora["27"]}﴾﴾\n
        ${this.Naml_50_51}\n﴿﴿${this.sora["27"]}﴾﴾\n
        ${this.Naml_62}\n﴿﴿${this.sora["27"]}﴾﴾
        ${this.hr}\n
        ${this.Kasas_36}\n﴿﴿${this.sora["28"]}﴾﴾\n
        .. ${this.Kasas_48.slice(this.Kasas_48.indexOf("قَالُوا سِحْرَانِ"))}\n﴿﴿${this.sora["28"]}﴾﴾
        ${this.hr}\n
        ${this.Al3ankapoot_4}\n﴿﴿${this.sora["29"]}﴾﴾
        ${this.hr}\n
        ${this.Room_21}\n﴿﴿${this.sora["30"]}﴾﴾
        ${this.hr}\n
        ${this.Lokman_16}\n﴿﴿${this.sora["31"]}﴾﴾
        ${this.hr}\n
        ${this.A7zab_3}\n﴿﴿${this.sora["33"]}﴾﴾\n
        .. ${this.A7zab_19.slice(this.A7zab_19.indexOf("أُولَٰئِكَ"))}\n﴿﴿${this.sora["33"]}﴾﴾\n
        ${this.A7zab_39}\n﴿﴿${this.sora["33"]}﴾﴾
        ${this.hr}\n
        ${this.Sabaa_13}\n﴿﴿${this.sora["34"]}﴾﴾\n
        ${this.Sabaa_21}\n﴿﴿${this.sora["34"]}﴾﴾\n
        ${this.Sabaa_48_49.slice(this.Sabaa_48_49.indexOf("﴿48﴾") + 4)}\n﴿﴿${this.sora["34"]}﴾﴾
        ${this.hr}\n
        ${this.Fater_2}\n﴿﴿${this.sora["35"]}﴾﴾\n
        ${this.Fater_43.slice(0, this.Fater_43.indexOf("فَهَلْ"))} .. ﴿43﴾\n﴿﴿${this.sora["35"]}﴾﴾
        ${this.hr}\n
        ${this.Saffat_1_10.slice(this.Saffat_1_10.indexOf("﴿6﴾") + 4, this.Saffat_1_10.indexOf("﴿7﴾") + 4)}\n﴿﴿${this.sora["37"]}﴾﴾\n
        ${this.Saffat_98}\n﴿﴿${this.sora["37"]}﴾﴾\n
        ${this.Saffat_143_144}\n﴿﴿${this.sora["37"]}﴾﴾
        ${this.hr}\n
        ${this.Basmala}\n${this.SaDD_1_4}\n﴿﴿${this.sora["38"]}﴾﴾
        ${this.hr}\n
        ${this.Zomar_36}\n﴿﴿${this.sora["39"]}﴾﴾\n
        ${this.Zomar_38}\n﴿﴿${this.sora["39"]}﴾﴾\n
        ${this.Zomar_62}\n﴿﴿${this.sora["39"]}﴾﴾
        ${this.hr}\n
        ${this.Ghafer_23_24}\n﴿﴿${this.sora["40"]}﴾﴾\n
        ${this.Ghafer_45}\n﴿﴿${this.sora["40"]}﴾﴾\n
        .. ${this.Ghafer_78.slice(this.Ghafer_78.indexOf("فَإِذَا"))}\n﴿﴿${this.sora["40"]}﴾﴾
        ${this.hr}\n
        .. ${this.Fussilat_12.slice(this.Fussilat_12.indexOf("وَحِفْظًا"))}\n﴿﴿${this.sora["41"]}﴾﴾\n
        ${this.Fussilat_54End}\n﴿﴿${this.sora["41"]}﴾﴾
        ${this.hr}\n
        ${this.Shora_6}\n﴿﴿${this.sora["42"]}﴾﴾\n
        ${this.Shora_24}\n﴿﴿${this.sora["42"]}﴾﴾
        ${this.hr}\n
        ${this.Zokhrof_30}\n﴿﴿${this.sora["43"]}﴾﴾
        ${this.hr}\n
        ${this.Dokhan_43_50.slice(0, this.Dokhan_43_50.indexOf("﴿45﴾") + 4)}\n﴿﴿${this.sora["44"]}﴾﴾
        ${this.hr}\n
        ${this.Mohammad_1}\n﴿﴿${this.sora["47"]}﴾﴾\n
        ${this.Mohammad_9}\n﴿﴿${this.sora["47"]}﴾﴾\n
        ${this.Mohammad_28}\n﴿﴿${this.sora["47"]}﴾﴾\n
        ${this.Mohammad_32}\n﴿﴿${this.sora["47"]}﴾﴾
        ${this.hr}\n
        ${this.Fat7_21}\n﴿﴿${this.sora["48"]}﴾﴾
        ${this.hr}\n
        ${this.Zariat_52}\n﴿﴿${this.sora["51"]}﴾﴾
        ${this.hr}\n
        ${this.TTur_15}\n﴿﴿${this.sora["52"]}﴾﴾
        ${this.hr}\n
        ${this.KKamar_2}\n﴿﴿${this.sora["54"]}﴾﴾
        ${this.hr}\n
        .. ${this.TalaQuePartOf_2_3.slice(this.TalaQuePartOf_2_3.indexOf("وَمَنْ يَتَوَكَّلْ"))}\n﴿﴿${this.sora["65"]}﴾﴾\n
        .. ${this.TalaQue_4.slice(this.TalaQue_4.indexOf("وَمَنْ"))}\n﴿﴿${this.sora["65"]}﴾﴾
        ${this.hr}\n
        ${this.Noo7_22}\n﴿﴿${this.sora["71"]}﴾﴾
        ${this.hr}\n
        ${this.Gen_28End}\n﴿﴿${this.sora["72"]}﴾﴾
        ${this.hr}\n
        ${this.Muzammel_9}\n﴿﴿${this.sora["73"]}﴾﴾
        ${this.hr}\n
        ${this.Muddather_21_24}\n﴿﴿${this.sora["74"]}﴾﴾
        ${this.hr}\n
        ${this.Enfetar_10}\n﴿﴿${this.sora["82"]}﴾﴾
        ${this.hr}\n
        ${this.Prooj_20}\n﴿﴿${this.sora["85"]}﴾﴾
        ${this.hr}\n
        ${this.Tareque_4}\n﴿﴿${this.sora["86"]}﴾﴾
        ${this.hr}\n
        ${this.Basmala}\n${this.Falaque_1_5End}\n﴿﴿${this.sora["113"]}﴾﴾
        ${this.hr}\n
        ${this.Basmala}\n${this.Nas_1_6End}\n﴿﴿${this.sora["114"]}﴾﴾
        ${this.hr}\n`;
    }

    ayatMashieWaArgol() {
        return `آيات المَشي والأَرجُل
        ${this.hr}\n 
        ${this.Esteaza}\n
        ${this.Maeda_6}\n﴿﴿${this.sora["5"]}﴾﴾\n
        ${this.Maeda_33_37.slice(0, this.Maeda_33_37.indexOf("﴿33﴾") + 4)}\n﴿﴿${this.sora["5"]}﴾﴾\n
        ${this.Maeda_66}\n﴿﴿${this.sora["5"]}﴾﴾
        ${this.hr}\n
        ${this.Anaam_65}\n﴿﴿${this.sora["6"]}﴾﴾
        ${this.hr}\n
        ${this.Aaraf_195}\n﴿﴿${this.sora["7"]}﴾﴾
        ${this.hr}\n
        ${this.Taha_71}\n﴿﴿${this.sora["20"]}﴾﴾
        ${this.hr}\n
        ${this.Nour_24}\n﴿﴿${this.sora["24"]}﴾﴾\n
        ${this.Nour_31}\n﴿﴿${this.sora["24"]}﴾﴾\n
        ${this.Nour_45}\n﴿﴿${this.sora["24"]}﴾﴾
        ${this.hr}\n
        ${this.Al3ankapoot_55}\n﴿﴿${this.sora["29"]}﴾﴾
        ${this.hr}\n
        ${this.Yaseen_65}\n﴿﴿${this.sora["36"]}﴾﴾
        ${this.hr}\n
        ${this.SaDD_42}\n﴿﴿${this.sora["38"]}﴾﴾
        ${this.hr}\n
        ${this.Momtahena_12}\n﴿﴿${this.sora["60"]}﴾﴾
        ${this.hr}\n`;

    }
    fakGennyMarpoot() {
        return `فَك الجِنّي المَربُوط
        ${this.hr}\n
        ${this.Esteaza}\n
        ${this.Al_Omran_173_174}\n﴿﴿${this.sora["3"]}﴾﴾ - ثلاث مرات
        ${this.hr}\n
        ${this.Israa_81_82.slice(0, this.Israa_81_82.indexOf("﴿81﴾") + 4)}\n﴿﴿${this.sora["17"]}﴾﴾ - ثلاث مرات
        ${this.hr}\n
        ${this.Anbiaa_10_18.slice(this.Anbiaa_10_18.indexOf("﴿17﴾") + 4, this.Anbiaa_10_18.indexOf("﴿18﴾") + 4)}
        ﴿﴿${this.sora["21"]}﴾﴾ - ثلاث مرات
        ${this.hr}\n
        ${this.Forquan_21_23.slice(this.Forquan_21_23.indexOf("﴿22﴾") + 4, this.Forquan_21_23.indexOf("﴿23﴾") + 4)}
        ﴿﴿${this.sora["25"]}﴾﴾ - ثلاث مرات
        ${this.hr}\n
        ${this.Room_30}\n﴿﴿${this.sora["30"]}﴾﴾ - ثلاث مرات
        ${this.hr}\n
        ${this.TalaQuePartOf_2_3}\n﴿﴿${this.sora["65"]}﴾﴾ - ثلاث مرات\n
        ${this.TalaQue_7}\n﴿﴿${this.sora["65"]}﴾﴾ - ثلاث مرات
        ${this.hr}\n
        ${this.Basmala}
        ${this.Falaque_1_5End}\n﴿﴿${this.sora["113"]}﴾﴾ - (11) مرة
        ${this.hr}\n
        ${this.Basmala}
        ${this.Nas_1_6End}\n﴿﴿${this.sora["114"]}﴾﴾ - (11) مرة
        ${this.hr}\n
        ثم بعد ذلك تقرأ هذه الأدعية
        \n${this.BasmalaLaYDor}\nثلاث مرات
        ${this.hr}\n
        أعوذُ باللهِ العَظِيمِ وبوجههِ الكريمِ مِنَ الشَيطانِ اللعينِ المريد\nثلاث مرات
        ${this.hr}\n
        اللهُمَّ إنِّي أسألُكَ بكلِ اسمٍ هوَ لكَ ؛ سميتَهُ في كتابِكَ أو عَلمتَهُ أحداً من خلقِكَ أو استأثرتَ بِهِ في علمِ الغيبِ عندَكَ ؛ أن تجعل القرءانَ العظيمَ ربيعَ قُلوبِنا وزوال همِّنا وأحزانِنا ؛ وأن تَفُكَ بِهِ القيودَ وتُزيلَ بِهِ الربطَ ؛ إنَّك أنت العزيزُ الحكيم والسميعُ العليم
        ${this.hr}\n
        بعد ذلك يقرأ الأية في قوله تعالى\n
        ${this.BaQura_8_9}\n﴿﴿${this.sora["2"]}﴾﴾ - ثلاث مرات
        ${this.hr}\n
        ${this.Nesa_145}\n﴿﴿${this.sora["4"]}﴾﴾ - ثلاث مرات
        ${this.hr}\n`;
    }
}

class RoquiaSplitAyat extends Roquia {
    constructor() {
        super();

    }
    BaQura_1 = this.BaQura_1_5.slice(0, this.BaQura_1_5.indexOf("﴿1﴾") + 4);
    BaQura_2 = this.BaQura_1_5.slice(this.BaQura_1_5.indexOf("﴿1﴾") + 4, this.BaQura_1_5.indexOf("﴿2﴾") + 4);
    BaQura_3 = this.BaQura_1_5.slice(this.BaQura_1_5.indexOf("﴿2﴾") + 4, this.BaQura_1_5.indexOf("﴿3﴾") + 4);
    BaQura_4 = this.BaQura_1_5.slice(this.BaQura_1_5.indexOf("﴿3﴾") + 4, this.BaQura_1_5.indexOf("﴿4﴾") + 4);
    BaQura_5 = this.BaQura_1_5.slice(this.BaQura_1_5.indexOf("﴿4﴾") + 4, this.BaQura_1_5.indexOf("﴿5﴾") + 4);
    BaQura_102 = this.BaQura_102_103.slice(0, this.BaQura_102_103.indexOf("﴿102﴾") + 4);
    BaQura_103 = this.BaQura_102_103.slice(this.BaQura_102_103.indexOf("﴿102﴾") + 4, this.BaQura_102_103.indexOf("﴿103﴾") + 4);


}

class Azkar extends Roquia {
    Asbahna1 = 'أصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله، ولا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليومِ وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُ بِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر';
    SayedEstighfar = 'اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ، خَلَقْتَنـي وَأَنا عَبْـدُك، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت، أَعـوذُ بِكَ مِنْ شَـرِّ ما صَنَـعْت، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ';
    Asbahna2 = 'اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك، وَمَلَائِكَتَكَ، وَجَمـيعَ خَلْـقِك، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.';
    Asbahna3 = 'اللّهُـمَّ ما أَصْـبَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.';
    A3afeney = 'اللّهُـمَّ عافِـني في بَدَنـي، اللّهُـمَّ عافِـني في سَمْـعي، اللّهُـمَّ عافِـني في بَصَـري، لا إلهَ إلاّ أَنْـتَ.';
    A3ozoMenElkofr = 'اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر، وَالفَـقْر، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر، لا إلهَ إلاّ أَنْـتَ.';
    El3foWel3afia = 'اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتي، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي، وَمِن فَوْقـي، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.';
    A3alemElghaibWelshahada = 'اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.';
    RaditBellah = 'رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.';
    Astaghith = 'يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.';
    Asbahna4 = 'أصْـبَحْنا وَأَصْـبَحَ المُـلكُ للهِ رَبِّ العـالَمـين، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا اليوم ، فَـتْحَهُ، وَنَصْـرَهُ، وَنـورَهُ وَبَـرَكَتَـهُ، وَهُـداهُ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه.';
    Asbahna5 = 'أصْـبَحْنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.';
    LaElahEllaAllah = 'لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ.';
    Esteghfar1 = 'أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ.';
    Esteghfar2 = 'أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.';
    Tsabih = 'سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه، وَرِضـا نَفْسِـه، وَزِنَـةَ عَـرْشِـه، وَمِـدادَ كَلِمـاتِـه.';
    AllahomSally = "اللهُمَّ صلِّ وسَلِّم علىَ نبيِّنا مُحَمَّد.";
    Asbahna6 = 'اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور.';
    constructor() {
        super();
    }
    morningAzkar = [this.Esteaza + "<br>" + this.ElKorsey + "<br>﴿﴿" + this.sora["2"] + "﴾﴾",
    this.Basmala + "<br>" + this.Ekhlas_1_4End + "<br>﴿﴿" + this.sora["112"] + "﴾﴾",
    this.Basmala + "<br>" + this.Falaque_1_5End + "<br>﴿﴿" + this.sora["113"] + "﴾﴾",
    this.Basmala + "<br>" + this.Nas_1_6End + "<br>﴿﴿" + this.sora["114"] + "﴾﴾", this.Asbahna1,
    this.SayedEstighfar, this.Asbahna2, this.Asbahna3,
    this.A3afeney, this.A3ozoMenElkofr, this.Hasbana, this.El3foWel3afia,
    this.A3alemElghaibWelshahada, this.BasmalaLaYDor, this.RaditBellah, this.EsteazaKalemat,
    this.Astaghith, this.Asbahna4, this.Asbahna5, this.LaElahEllaAllah, this.Esteghfar2,
    this.Tsabih, this.AllahomSally, this.Asbahna6, "إنتهى"];
    morningAzkarItter = [1, 3, 3, 3, 1, 1, 4, 1, 3, 3, 7, 1, 1, 3, 3, 3, 3, 1, 1, 10, 3, 3, 10, 1, 0];

    evening(param) {
        let result = param.replaceAll(/أصْـبَحْنا|أَصْـبَحَ|اليوم/gi, function (x) {
            if (x == "أصْـبَحْنا") return "أمسَينا";
            if (x == "أَصْـبَحَ") return "أمسىَ";
            if (x = "اليوم") return "الليلة";
            //if (x == "هـذا ") return "هـذه";
            // if (x == "بَعْـدَه") return "بعـدها";
        });
        let totalResult = result.replace(/هـذا|بَعْـدَه|النُّـشُور/gi, function (y) {
            if (y == "هـذا") return "هـذه";
            if (y == "بَعْـدَه") return "بَعـدَها";
            if (y == "النُّـشُور") return "المَصير";
        });
        let totalResult2 = totalResult.replace(/أَصْبَـحْتُ|فَـتْحَهُ|نَصْـرَهُ/gi, function (z) {
            if (z == "أَصْبَـحْتُ") return "أمسَيتُ";
            if (z == "فَـتْحَهُ") return "فَتحَهَا";
            if (z == "نَصْـرَهُ") return "نَصرَهَا";
        });
        let totalResult3 = totalResult2.replace(/نـورَهُ|بَـرَكَتَـهُ|هُـداهُ/gu, function (z2) {
            if (z2 == "نـورَهُ") return "نُورَهَا";
            if (z2 == "بَـرَكَتَـهُ") return "بَرَكَتهَا";
            if (z2 == "هُـداهُ") return "هُدَاهَا";
        });
        let totalResult4 = totalResult3.replace("فـيهِ", "فيهَا");
        return totalResult4;

    }

    eveningAzkar = [this.Esteaza + "<br>" + this.ElKorsey + "<br>﴿﴿" + this.sora["2"] + "﴾﴾",
    this.Esteaza + "<br>" + this.BaQura_284_End.slice(this.BaQura_284_End.indexOf("﴿284﴾") + 5) + "<br>﴿﴿" + this.sora["2"] + "﴾﴾",
    this.Basmala + "<br>" + this.Ekhlas_1_4End + "<br>﴿﴿" + this.sora["112"] + "﴾﴾",
    this.Basmala + "<br>" + this.Falaque_1_5End + "<br>﴿﴿" + this.sora["113"] + "﴾﴾",
    this.Basmala + "<br>" + this.Nas_1_6End + "<br>﴿﴿" + this.sora["114"] + "﴾﴾", this.evening(this.Asbahna1),
    this.evening(this.Asbahna6), this.SayedEstighfar, this.evening(this.Asbahna2), this.evening(this.Asbahna3),
    this.A3afeney, this.A3ozoMenElkofr, this.Hasbana, this.El3foWel3afia, this.A3alemElghaibWelshahada,
    this.BasmalaLaYDor, this.EsteazaKalemat, this.RaditBellah, this.Astaghith, this.evening(this.Asbahna4),
    this.evening(this.Asbahna5), this.LaElahEllaAllah, this.Esteghfar2, this.AllahomSally, "إنتهى"];
    eveningAzkarItter = [1, 1, 3, 3, 3, 1, 1, 1, 4, 1, 3, 3, 7, 1, 1, 3, 3, 3, 3, 1, 1, 10, 3, 10, 0];

    estikazMenNoum() {
        return `اذكار الاستيقاظ من النوم
            ${this.hr}\n
            عن عبادة بن الصامت رضي الله تعالى عنه عن النبي قال: «من تعار_اى استيقظ_من الليل فقال: لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير. الحمد لله وسبحان الله ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله». ثم قال: «اللهم اغفر لي أو دعا استجيب له فإن توضأ وصلى قبلت صلاته»
            ﴿صحيح البخارى﴾
            ${this.hr}\n
            «الحمد لله الذي أحيانا بعدما أماتنا وإليه النشور»
            ﴿البخارى ومسلم﴾
            ${this.hr}\n
            قال النبى صلى الله عليه وسلم «إذا استيقظ أحدكم من نومه فلا يدخل يده في الإناء حتى يغسلها ثلاثًا فإن أحدكم لا يدري أين باتت يده»
            ﴿البخارى ومسلم﴾
            ${this.hr}\n
            عن أبي أمامة قال: سمعْتُ رسول الله يقول: (( مَنْ أَوى إلى فِراشِهِ طاهِراً....لمْ يَنقلِبْ ساعَةً من اللَّيلِ يَسألُ الله شيئاً مِنْ خيرِ الدُّنيا والآخِرِة, إلا أعْطاهُ الله إِياهُ ))
            ﴿صحيح الكلم الطيب 36﴾
            ${this.hr}\n
            عن ابن عباس قال:بِتُّ عندَ خالتي ميمونةَ زوج النبي ليلةً, فنام رسول الله حتى انتصفَ الليلُ, أو قبلهَ بقليل, أو بعده بقليل, فقام النبي  من الليل ثم استيقَظَ رسول الله فجلَسَ, فمسح النوم عن وجههِ بيدِه فنظر إلى السماء ثم قرأ العشرَ آيات خواتم سورة  آل عمران   إنَّ في خلقِ السماواتِ والأرض واختلاف الليل والنهارِ لآيات لأُولي الألباب... [الآية190 إلى آخر السورة ]
            ﴿مختصر البخاري 92﴾
            ${this.hr}\n`;
    }

    dokhoolWaKhroogMenMasged() {
        return `اذكار الدخول والخروج من المسجد
            ${this.hr}\n
            عن فاطمة بنت الحسين عن فاطمة بنت النبي قالت: قال لي رسول الله إذا دخلتِ فقولي: (( بسم الله والسلام على رسول الله اللَّهُمَّ صلّ على محمد وعلى آل محمد وسهل لنا أبواب فضلك))
            ﴿فضل الصلاة على النبي  72﴾
            ${this.hr}\n
            عن أبي حميد أو أبي أسيد الأنصاري قال: قال رسول الله : (( إذا خرج [أحدكم من المسجد]فليسلم على النبي وليقل: اللهم إني أسألك من فضلك ))
            ﴿صحيح أبي داود 484﴾
            ${this.hr}\n
            عن أبي هريرة أن رسول الله قال: (( إذا خرج [أحدكم من المسجد] فليُسلم على النبي وليقل اللهم اعصمني من الشيطان الرجيم ))
            ﴿[صحيح ابن ماجه 632][تمام المنة290]﴾
            ${this.hr}\n
            عن فاطمة بنت الحسين عن فاطمة بنت النبي قالت: قـال لي رسول الله إذا دخلتِ فقولي: (( بسم الله والسلام على رسول الله اللَّهُمَّ صلّ على محمد وعلى آل محمد وسهل لنا أبواب رحمتك. فإذا فرغت فقولي: مثل ذلك غير أن قولي: وسهل لنا أبواب فضلك ))
            ﴿فضل الصلاة على النبي  72﴾
            ${this.hr}\n
            عن فاطمة بنْتِ رسولِ الله قالت: كانَ رسولُ اللهِ إذا دخلَ المسجدَ يقولُ: (( بسمِ اللهِ والصلاة والسَّلام على رسولِ اللهِ اللَّهمَّ افتح لي أبوابَ رحمتِكَ))
            ﴿[صحيح ابن ماجه 632][تمام المنة290]﴾
            ${this.hr}\n
            عبد لله بن عمرو عن النبي أنّهُ كانَ إذَا دَخَلَ المسجد قالَ: ((أعُوذُ باللهِ العَظِيمِ وبِوجْهِهِ الكَرِيمِ وسُلطَانِهِ القَدِيمِ مِنَ الشَّيْطانِ الرَّجِيمِ )) قالَ: (( فإذَا قَالَ ذَلِكَ قالَ الشَّيْطَانُ: حُفِظَ مِنَّي سَائِرَ اليوْمِ ))
            ﴿صحيح أبي داود485﴾
            ${this.hr}\n`;
    }
    dokhoolWakhroogMenManzel() {
        return `اذكار الدخول والخروج من المنزل
            ${this.hr}\n
            عن أنس قال: قال رسول الله :مِنَ قالَ إذا خَرَجَ مِن بيتِه : (( بِسْمِ الله توَكَّلْتُ على الله لا حَوْلَ ولا قوَّةَ إلا بالله تعالى يُقالُ له: كُفِيتَ ووُقِيتَ وهُدِيتَ وتنحَّى عنه الشيطانُ ؛ فيقـولُ لشيطانٍ آخر: كيفَ لكَ برَجلٍ قَدْ هُدِيَ وكُفِيَ ووُقِيَ؟ ))
            ﴿صحيح الكلم 44﴾
            ${this.hr}\n
            وقالت أم سلمة ما خَرَجَ رسولُ اللهِ من بيتي قَطُّ إلا قال: (( بسمِ اللهِ توكلتُ على اللهِ؛ اللهمَّ إني أعوذ بك من أن أضِلَّ أو أُضلُّ أو أَزِلَّ أو أُزَلُّ أو أَظْلمَّ أو أُظْلمُّ أو أَجْهـلَّ أو يُجْهلُّ عليّ أو أن أبغي أو يُبغى عليَّ ))
            ﴿صحيح الكلم 45﴾
            ${this.hr}\n
             عن أبي هريرة عن النبي قال: (( إذا خرَجت من مَنْـزلك فَصَلّ ركعتين يمنعانكَ من مخرجِ السوءِ وإذا دَخَلْتَ إلى منـزلك فصَلّ ركعتين يمنعانكَ من مدخل السوء ))
            ﴿الصحيحة 1323﴾
            ${this.hr}\n
            قال جابرسمعت النبي يقول: (( إذا دخل الرجلُ بَيتَهُ فَذكَرَ اللهَ تعالى عند دخوله وعند طعامه قال الشّيطـان: لا مبيتَ لكـم ولا عَشاءَ وإذا دخـل فلـم يذكر الله تعالى عند دخوله قال الشيطان: أدركتُم المبيِتَ وإذا لم يذكر الله تعالى عند طعامه قال: أدركتُم المبيتَ والعَشاء ))
            ﴿مختصر مسلم 1297﴾
            ${this.hr}\n
            عن أنس قال لي رسول الله: (( يا بُنيَّ! إذا دَخَلْتَ على أَهلِكَ فسلِّمْ؛ يكُنْ بَرَكَةً عليكَ وعلى أهلِ بيتِكَ ))
            ﴿صحيح الكلم 47﴾
            ${this.hr}\n
            عن أبي أمامة أن رسول الله قال: (( ثلاثةٌ كلُّهمْ ضامنٌ على الله إن عاش رُزقِ وكُفِيَ؛ وإن ماتَ أدخلَهُ اللهُ الجنّة من دخل بيتَه فَسَلَّمَ فهو ضامنٌ على الله))
            ﴿[صحيح الترغيب 319][صحيح الجامع 3053]﴾
            ${this.hr}\n
            «اللهم إني أسألك خير المولج وخير المخرج، بسم الله ولجنا، وبسم الله خرجنا، بسم الله ولجنا، وبسم الله خرجنا، وعلى ربنا توكلنا»  ثم يسلم على أهله
            ﴿حسن .. رواه ابو داوود﴾
            ${this.hr}\n`;
    }

    ta3amWaShrap() {
        return `أذكار الأكل والشرب
            ${this.hr}\n
            «بسم الله» فإن نسي أن يذكر اسم الله تعالى في أوله فليقل: «بسم الله أوله وآخره»
            ﴿قال الترمذى حسن صحيح﴾
            ${this.hr}\n
            ((بِسْمِ اللهِ)) . (صحيح الكلم: 149) قالَ الشيخُ - رحمَهُ اللهُ -: وفي هذا الحديثِ أنَّ التسميةَ في أوَّلِ الطعامِ بلفظِ ((بسمِ اللهِ)) لا زيادةَ فيها، وكلّ الأحاديثِ الصحيحةِ التي وردتْ في البابِ ليسَ فيها الزيادةُ، ولا أعلمُها وردتْ في حديثٍ، فهي بدعةٌ عندَ الفقهاءِ بمعنى البدعةِ
            ﴿الصحيحة: 71﴾
            ${this.hr}\n
            ((مَنْ أَكَلَ طَعَامًا فَقَالَ: الْحَمْدُ للهِ الَّذِي أَطْعَمَنِي هَذَا وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِّنِّي وَلاَ قُوَّةٍ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ))
            ﴿صحيح أبي داود: 4023﴾
            ${this.hr}\n
            ((الْحَمْدُ للهِ كَثِيرًا طَيِّبًا مُّبَارَكًا فِيهِ؛ الْحَمْدُ للهِ الَّذِي كَفَانَا وَأَرْوَانَا غَيْرَ مَكْفِيٍّ وَلاَ مَكْفُورٍ)) . وَقَالَ مَرَّةً: ((لَكَ الْحَمْدُ رَبَّنَا غَيْرَ مَكْفِيٍّ ولاَ مُوَدَّعٍ وَلاَ مُسْتَغْنًى عَنْهُ رَبَّنَا))
            ﴿(مختصر البخاري: 2157),(صحيح أبي داود: 3849)﴾
            ${this.hr}\n
            ((اَللَّهُمَّ بَارِكْ لَنَا فِيهِ وَزِدْنَا مِنْهُ))
            ﴿صحيح أبي داود: 3730﴾
            ${this.hr}\n
            كَانَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَشْرَبُ فِي ثَلاَثَةِ أَنْفَاسٍ، إِذَا أَدْنَى الإِنَاءَ إِلَى فَمِهِ سَمَّى اللهَ تَعَالَى؛ وَإِذَا أَخَّرَهُ حَمِدَ اللهَ تَعَالَى، يَفْعَلُ ذَلِكَ ثَلاَثَ مَرَّاتٍ
            ﴿الصحيحة: 1277﴾
            ${this.hr}\n`;
    }
    lebsWaKhal3Elthiab() {
        return `أذكار لبس وخلع الثياب
            ${this.hr}\n
            عن أنس قال: قال رسول الله: (( سترُ ما بينَ أعْيُنِ الجنِّ وعوْراتِ بني آدمَ إذا وضعَ أحدهـم ثوبهُ أنْ يقولَ: بسمِ الله ))
            ﴿صحيح الجامع 3610﴾
            ${this.hr}\n
            عن أبي سعيد الخدري قال: كان رسول الله إذا استجَدَّ ثوباً سماهُ بِاسمهِ إما قميصاً أو عمامةً ثم يقولُ: (( اللَّهمَّ لكَ الحمدُ أنتَ كَسَوتنِيهِ؛ أسألُكَ مِنْ خيرهِ وخيرِ ما صُنِعَ لهُ؛ وأعوذُ بكَ من شرِّهِ وشرِّ ما صُنِعَ لهُ ))
            ﴿صحيح أبي داود 4020﴾
            ${this.hr}\n
            وعن معاذ بن أنس أن رسول الله قال: (( ومَنْ لَبِسَ ثوباً فقال : الحمدُ لله الذي كَساني هذا الثـوب ورَزَقنيه مِنْ غيِر حـولٍ منِّي ولا قُوّةٍ؛ غُفـِرَ له مـا تقـدَّم مـِنْ ذنْبِه ))
            ﴿صحيح أبي داود 4023﴾
            ${this.hr}\n
            عن ابن عمر قال رأى النبي على عمر ثوباً أبيض فقال: (( أجديدٌ هذا أم غسيل؟)) فقال غسيل.(وفي رواية جديداً) فقال: (( الْبَسْ جَديداً؛ وعِشْ حَميداً؛ ومُتْ شهيداً؛ ويرزقُكَ اللهُ قرَّةَ عينٍ في الدُّنيا والآخِرةِ ))
            ﴿الصحيحة 352 - صحيح الجامع 1234﴾
            ${this.hr}\n
            قال أبو نضرَةَ كانَ أصحَابُ النبيِّ إذا لـَبِسَ أحَدُهُـمْ ثَوبـاً جَدِيداً قِيلَ لهُ : تُبْلِي ويُخْلِفُ اللهُ تَعَالَى.
            ﴿صحيح أبي داود 4020﴾
            ${this.hr}\n`;
    }

    elzoagWaElgema3() {
        return `أذكار الزواج والجِماع
            ${this.hr}\n
            (بَارَكَ اللهُ لَكَ؛ وَبَارَكَ عَلَيْكَ؛ وَجَمَعَ بَيْنَكُمَا فِي – وفي روايةٍ: عَلَى- خَيْرٍ))
            ﴿آداب الزفاف: 175﴾
            ${this.hr}\n
            ((لَوْ أَنَّ أَحَدَكُمْ يَقُولُ -حِينَ يَأْتِي أَهْلَهُ-: اللَّهُمَّ جَنِّبْنِي الشَّيْطَانَ؛ وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا؛ ثُمَّ قُدِّرَ بَيْنَهُمَا فِي ذَلِكَ وَلَدٌ لَمْ يَضُرَّهُ الشَّيْطَانُ أَبَدًا وَلَمْ يُسَلَّطْ عَلَيْهِ))
            ﴿ختصر البخاري: 2073﴾
            ${this.hr}\n
            ((إِذَا تَزَوَّجَ أَحَدُكُمُ امْرَأَةً فَلْيَأْخُذْ بِنَاصِيَتِهَا؛ وَلْيُسَمِّ اللهَ - عَزَّ وَجَلَّ - وَلْيَدْعُ بِالْبَرَكَةِ؛ وَلْيَقُلِ: اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِهَا وَخَيْرِ مَا جَبَلْتَهَا عَلَيْهِ؛ وَأَعُوذُ بِكَ مِنْ شَرِّهَا وَشَرِّ مَا جَبَلْتَهَا عَلَيْهِ))
            ﴿آداب الزفاف: 92﴾
            ${this.hr}\n
            وعن نفر من أصحاب النبي صلى الله عليه وسلم وفيهم ابن مسعود وأبو ذر وحذيفة فقالوا: ((إِذَا دَخَلَ عَلَيْكَ أَهْلُكَ فَصَلِّ رَكْعَتَيْنِ, ثُمَّ سَلِ اللهَ مِنْ خَيْرِ مَا دَخَلَ عَلَيْكَ؛ وَتَعَوَّذْ بِهِ مِنْ شَرِّهِ؛ ثُمَّ شَانكَ وَشَان أَهْلِكَ))
            ﴿آداب الزفاف: 92﴾
            ${this.hr}\n`;
    }

    elnoum() {
        return `أذكار النوم
            ${this.hr}\n
            عن عائشة رضي الله تعالى عنها أن النبي كان إذا أوى إلى فراشه كل ليلة جمع كفيه ثم نفث فيهما فقرأ فيهما (قل هو الله أحد) و(قل أعوذ برب الفلق) و(قل أعوذ برب الناس) ثم يمسح بهما ما استطاع من جسده يبدأ بهما على رأسه ووجهه وما أقبل من جسده يفعل ذلك ثلاث مرات
            ﴿صحيح البخارى﴾
            ${this.hr}\n
            «الله أكبر» أربعا وثلاثين مرة «الحمد لله» ثلاثا وثلاثين مرة «سبحان الله» ثلاثا وثلاثين مرة
            ﴿البخارى ومسلم﴾
            ${this.hr}\n
            «باسمك ربي وضعت جنبي وبك أرفعه إن أمسكت نفسي فارحمها وإن أرسلتها فاحفظها بما تحفظ به عبادك الصالحين
            ﴿البخارى ومسلم﴾
            ${this.hr}\n
             قال النبي صلى الله عليه وسلم «من قرأ الآيتين من آخر سورة البقرة في ليلة كفتاه»
            ﴿البخارى ومسلم﴾
            ${this.hr}\n
            «اللهم قني عذابك يوم تبعث عبادك» ثلاث مرات
            ﴿حسنه الترمذى﴾
            ${this.hr}\n
            «الحمد لله الذي أطعمنا وسقانا وكفانا وآوانا فكم ممن لا كافي له ولا مؤوي»
            ﴿صحيح مسلم﴾
            ${this.hr}\n
            قراءة آية الكرسي. من قرأها لا يزال عليه من الله حافظ ولا يقربه شيطان حتى يصبح" وهي (الله لا إله إلا هو الحي القيوم) الآية 255 من سورة البقرة.
            ﴿متفق على معناه﴾
            ${this.hr}\n
            «باسمك اللهم أموت وأحيا»
            ﴿البخارى ومسلم﴾
            ${this.hr}\n
            - عن البراء بن عازب رضي الله عنهما قال: قال لي رسول الله : «إذا أتيت مضجعك فتوضأ وضوءك للصلاة ثم اضطجع على شقك الأيمن وقل: اللهم أسلمت نفسي إليك وفوضت أمري إليك وألجأت ظهري إليك رغبة ورهبة إليك لا ملجأ ولا منجا منك إلا إليك آمنت بكتابك الذي أنزلت وبنبيك الذي أرسلت، فإن مت، مت على الفطرة، واجعلهن آخر ما تقول" وفي رواية للبخاري وإن أصبحت أصبت خيرا.
            ﴿البخارى ومسلم﴾
            ${this.hr}\n
            سورة (قل يا أيها الكافرون) فإنها براءة من الشرك
            ﴿اخرجه ابو داوود والنسائى وصححه الحاكم وابن حبان﴾
            ${this.hr}\n
            عن أنس بن مالك قال: قال رسول الله : (( منَ قالَ إذا أوَى إلى فِراشِه: الحمدُ لله الذي كفَاني وآواني, الحمدُ لله الذي أطْعمني وسقاني, الحمدُ لله الذي مَنَّ عليَّ وأفضلَ اللَّهُمَّ إنِّي أسألُك بعزَّتك أنْ تُنجيني من النَّار, فقدْ حَمِدَ اللهَ بجميعِ محامدِ الخلقِ كلِّهم ))
            ﴿الصحيحة 3444﴾
            ${this.hr}\n
             عن جابر قال:(( كانَ رسول الله لا ينامُ حتى يقرأ: ألم. تنـزيلُ السجدة و تباركَ الذي بيدِهِ الملكُ
            ﴿لصحيحة 585﴾
            ${this.hr}\n
            عن العِرْبَاضِ بن سَارِيَةَ أنّ النبي كانَ لا يَنَامُ حتَّى يَقْرَأَ المسبِّحَاتِ, ويقُولُ: (( فيها آيةٌ خيرٌ مِنْ ألْفِ آيَةِ ))
            ﴿صحيح الترمذي 3406﴾
            ${this.hr}\n
            ما يقولُه إذا أوى إلى فراشه : " اللهمَّ ربَّ السماوات ِوربَّ الأرضِ وربَّ العرشِ العظيمِ . ربَّنا وربَّ كلّ شئٍ . فالقَ الحبِّ والنوى . ومنزلَ التوراةِ والإنجيلِ والفرقانِ . أعوذ بك من شرِّ كلِّ شيءٍ أنت آخذٌ بناصيته . اللهمَّ ! أنت الأولُ فليس قبلك شئٌ . وأنت الآخرُ فليس بعدك شئٌ . وأنت الظاهرُ فليس فوقَك شئٌ . وأنت الباطنُ فليس دونك شئٌ . اقضِ عنا الدَّينَ وأغنِنا من الفقرِ "
            ﴿صحيح مسلم﴾
            ${this.hr}\n
            ما يقولُه إذا أخذ مضجعَه من اللَّيلِ قالَ : بِسمِ اللهِ وضَعتُ جَنبي ، اللَّهمَّ اغفِر لي ذَنبي ، و اخسأْ شَيطاني ، و فُكَّ رهاني ، و ثَقِّلْ ميزاني ، و اجعَلني في النَّدِيِّ الأعلَى
            ﴿صحيح الجامع﴾
            ${this.hr}\n
            ما يقولُه إذا أوى إلى فراشه "للَّهُمَّ أنْتَ خَلَقْتَ نَفْسِي وأنْتَ تَتَوَفَّاها، لَكَ مَمَاتُها وَمَحْياها، إنْ أحْيَيْتَها فاحْفَظْها، وَإنْ أمَتَّها فاغْفِرْ لَهَا، اللَّهُمَّ إنِّي أسألُكَ العافِيَةَ"
            ﴿صحيح مسلم﴾
            ${this.hr}\n
            ما يقولُه إذا أوى إلى فراشه : "اللهُمَّ عالمَ الغيبِ والشهادةِ فاطرَ السمواتِ والأرضِ ربَّ كلِّ شيءٍ ومليكَه أشهدُ أنْ لا إلهَ إلا أنتَ أعوذُ بكَ مِن شرِّ نفسي ومِن شرِّ الشيطانِ وَشِرْكِه قال قلْهُ إذا أصبحتَ وإذا أمسَيتَ وإذا أخذتَ مَضْجَعَكَ"
            ﴿سنن الترمذي﴾
            ${this.hr}\n`;
    }

    dokhoolWakhroogMenElkhalaa() {
        return `أذكار الدخول والخروج من الخلاء
            ${this.hr}\n
            عن زيد بن أرقمَ عن رسولُ الله قالَ: (( أنّ هذِهِ الحُشُوشُ مُحتضَرَةٌ, فإذَا أتى أحَدُكُمُ الَخلاءَ فليقُلْ: أعُوذُ بِالله مِنَ الخُبُثِ والخبَائثِ ))
            ﴿صحيح أبي داود 6﴾
            ${this.hr}\n
            عن علي مرفوعاً: (( سَتْرُ مَا بَينَ الجِنِّ وعَوْرَاتِ بِنَي آدَم إذَا دَخَلَ الخَلاءَ أنْ يقُولَ: بِسْمِ الله ))
            ﴿الإرواء 50﴾
            ${this.hr}\n`;
    }

    maTaquolEzaRaaytFiManamekMaTakrah() {
        return `أذكار ما تقول إذا رأيت في منامك ما تحب وتكره
            ${this.hr}\n
            قال رسول اللّه صلى اللّه عليه وسلم : "إذَا رَأى أحَدُكُمْ رُؤْيا يُحِبُّها، فإنَّمَا هِيَ مِنَ اللَّهِ تَعالى، فَلْيَحْمَدِ اللَّه تَعالى عَلَيْها وَلْيُحَدّثْ " وفي رواية " يُحَدِّثْ بِها إِلاَّ مَنْ يُحِبُّ، وَإذَا رأى غَيْرَ ذلكَ مِمَّا يَكْرَهُ فإنَّمَا هِيَ مِنَ الشَّيْطانِ فَلْيَسْتَعِذْ مِنْ شَرِّها وَلا يَذْكُرْها لأحَدٍ فإنها لا تضره"
            ﴿صحيح البخاري﴾
            ${this.hr}\n
            قال رسول اللّه صلى اللّه عليه وسلم : "الرُّؤْيا الصَّالِحَةُ" وفي رواية "الرُّؤْيا الحَسَنَةُ مِنَ اللَّهِ، والحُلْمُ مِنَ الشَّيْطانِ، فَمَنْ رأى شَيْئاً يَكْرَهُهُ فَلْيَنْفُثْ عَنْ شِمالِهِ ثَلاثاً وَلْيَتَعَوَّذْ مِنَ الشَّيْطان ، فإنهَا لا تضره "  وفي رواية "فَلْيَبْصُقْ" بدل: فلينفثْ، والظاهر أن المراد النفث، وهو نفخ لطيف لا ريق معه .
            ﴿البخاري ومسلم﴾
            ${this.hr}\n
            قال رسول اللّه صلى اللّه عليه وسلم: "إِذَا رأى أحَدُكُمُ الرُّؤيا يَكْرَهُها فَلْيَبْصُقْ عَنْ يَسارِهِ ثَلاثاً، وَلْيَسْتَعِذْ باللَّه مِنَ الشَّيْطانِ ثَلاثاً، وَلْيَتَحَوَّلْ عَنْ جَنْبِهِ الَّذِي كانَ عَلَيْهِ"
            ﴿صحيح مسلم﴾
            ${this.hr}\n
            قال رسول اللّه صلى اللّه عليه وسلم: "إذا رأى أحدُكم ما يكرهُ فلا يُحَدِّثْهُ أَحَدًا وليَقُمْ فليُصَلِّ ركعتينِ"
            ﴿لسلسلة الصحيحة﴾
            ${this.hr}\n`;
    }
}
/* 
=====================================================
<p>replace() searches a string for a value,
and returns a new string with the specified value(s) replaced:</p>

<p id="demo">أصبحنا وأصبح الملك لله</p>

<script>
let text = document.getElementById("demo").innerHTML; 
let result = text.replace(/أصبحنا|وأصبح/gi, function (x) {
  if (x== "أصبحنا") return "أمسينا";
  if (x== "وأصبح") return "وأمسى";
  
});

document.getElementById("demo").innerHTML = result;
</script>
// output أمسينا وأمسى الملك لله
========================================================
<p>replace() searches a string for a value,
and returns a new string with the specified value(s) replaced:</p>

<p id="demo">Mr Blue has a blue house and a blue car.</p>

<script>
let text = document.getElementById("demo").innerHTML; 
let result = text.replace(/blue/gi, "red");
document.getElementById("demo").innerHTML = result;
</script>
// output Mr red has a red house and a red car.
=========================================================
<p>replace() searches a string for a value,
and returns a new string with the specified value(s) replaced:</p>

<p id="demo">Visit Microsoft!</p>

<script>
let text = document.getElementById("demo").innerHTML; 
document.getElementById("demo").innerHTML = text.replace("Microsoft", "W3Schools");
</script>
// output Visit W3Schools!
===========================================================
<p>replace() searches a string for a value,
and returns a new string with the specified value(s) replaced:</p>

<p id="demo">Mr Blue has a blue house and a blue car.</p>

<script>
let text = document.getElementById("demo").innerHTML; 
let result = text.replace(/blue|house|car/gi, function (x) {
  return x.toUpperCase();
});

document.getElementById("demo").innerHTML = result;
</script>
// output Mr BLUE has a BLUE HOUSE and a BLUE CAR.
============================================================
*/